(function webpackUniversalModuleDefinition(root, factory) {
	if(typeof exports === 'object' && typeof module === 'object')
		module.exports = factory();
	else if(typeof define === 'function' && define.amd)
		define([], factory);
	else if(typeof exports === 'object')
		exports["Examples"] = factory();
	else
		root["Examples"] = factory();
})((typeof self !== "undefined" ? self : this), function() {
return /******/ (function(modules) { // webpackBootstrap
/******/ 	// The module cache
/******/ 	var installedModules = {};
/******/
/******/ 	// The require function
/******/ 	function __webpack_require__(moduleId) {
/******/
/******/ 		// Check if module is in cache
/******/ 		if(installedModules[moduleId]) {
/******/ 			return installedModules[moduleId].exports;
/******/ 		}
/******/ 		// Create a new module (and put it into the cache)
/******/ 		var module = installedModules[moduleId] = {
/******/ 			i: moduleId,
/******/ 			l: false,
/******/ 			exports: {}
/******/ 		};
/******/
/******/ 		// Execute the module function
/******/ 		modules[moduleId].call(module.exports, module, module.exports, __webpack_require__);
/******/
/******/ 		// Flag the module as loaded
/******/ 		module.l = true;
/******/
/******/ 		// Return the exports of the module
/******/ 		return module.exports;
/******/ 	}
/******/
/******/
/******/ 	// expose the modules object (__webpack_modules__)
/******/ 	__webpack_require__.m = modules;
/******/
/******/ 	// expose the module cache
/******/ 	__webpack_require__.c = installedModules;
/******/
/******/ 	// define getter function for harmony exports
/******/ 	__webpack_require__.d = function(exports, name, getter) {
/******/ 		if(!__webpack_require__.o(exports, name)) {
/******/ 			Object.defineProperty(exports, name, { enumerable: true, get: getter });
/******/ 		}
/******/ 	};
/******/
/******/ 	// define __esModule on exports
/******/ 	__webpack_require__.r = function(exports) {
/******/ 		if(typeof Symbol !== 'undefined' && Symbol.toStringTag) {
/******/ 			Object.defineProperty(exports, Symbol.toStringTag, { value: 'Module' });
/******/ 		}
/******/ 		Object.defineProperty(exports, '__esModule', { value: true });
/******/ 	};
/******/
/******/ 	// create a fake namespace object
/******/ 	// mode & 1: value is a module id, require it
/******/ 	// mode & 2: merge all properties of value into the ns
/******/ 	// mode & 4: return value when already ns object
/******/ 	// mode & 8|1: behave like require
/******/ 	__webpack_require__.t = function(value, mode) {
/******/ 		if(mode & 1) value = __webpack_require__(value);
/******/ 		if(mode & 8) return value;
/******/ 		if((mode & 4) && typeof value === 'object' && value && value.__esModule) return value;
/******/ 		var ns = Object.create(null);
/******/ 		__webpack_require__.r(ns);
/******/ 		Object.defineProperty(ns, 'default', { enumerable: true, value: value });
/******/ 		if(mode & 2 && typeof value != 'string') for(var key in value) __webpack_require__.d(ns, key, function(key) { return value[key]; }.bind(null, key));
/******/ 		return ns;
/******/ 	};
/******/
/******/ 	// getDefaultExport function for compatibility with non-harmony modules
/******/ 	__webpack_require__.n = function(module) {
/******/ 		var getter = module && module.__esModule ?
/******/ 			function getDefault() { return module['default']; } :
/******/ 			function getModuleExports() { return module; };
/******/ 		__webpack_require__.d(getter, 'a', getter);
/******/ 		return getter;
/******/ 	};
/******/
/******/ 	// Object.prototype.hasOwnProperty.call
/******/ 	__webpack_require__.o = function(object, property) { return Object.prototype.hasOwnProperty.call(object, property); };
/******/
/******/ 	// __webpack_public_path__
/******/ 	__webpack_require__.p = "";
/******/
/******/
/******/ 	// Load entry module and return exports
/******/ 	return __webpack_require__(__webpack_require__.s = 0);
/******/ })
/************************************************************************/
/******/ ([
/* 0 */
/***/ (function(module, exports, __webpack_require__) {

function loadExamples() {
  const examples = {};

  try {
    const raw = __webpack_require__(1);

    raw.keys().forEach(key => {
      examples[key.slice(2, -3)] = raw(key).default;
    });
  } catch (e) {}

  return examples;
}

module.exports = {
  examples: loadExamples(),
  examplesAlias: {
    beer: "九十九瓶啤酒",
    collatz: "考拉兹猜想",
    collatz2: "考拉兹猜想二",
    divination: "春秋古筮法",
    draw_heart: "畫心",
    eightqueens: "八皇后問題",
    euclidean: "歐幾里得法",
    factorial: "階乘",
    fibonacci: "斐氏列",
    fibonacci2: "斐氏列二",
    fibonacci_array: "斐氏列三",
    fizzbuzz: "嘶嘶嗡嗡",
    hanoi: "漢諾塔",
    hanoi_stack: "漢諾塔二",
    helloworld: "問天地好在",
    "helloworld+": "問天地好在+",
    import: "導入示例",
    crt: "大衍總數",
    serialization: "渾沌經",
    linglong_tower: "玲瓏塔",
    mandelbrot: "曼德博集",
    mergesort: "歸併排序",
    macro: "宏示例",
    misc: "雜項",
    modinv: "大衍求一術",
    multiplication_table: "乘算口訣",
    nested_fun: "嵌套調用示例",
    obj: "对象示例",
    pi_leibniz: "萊布尼茲圓周率估算",
    pi_liuhui: "劉徽割圓術求圓周率",
    quicksort: "快速排序",
    quicksort_inplace: "快速排序二",
    quine: "自產生程式",
    quine2: "自產生程式二",
    selectionsort: "選擇排序",
    sieve: "埃氏篩",
    sqrt_newton: "牛頓求根法",
    turing: "圖靈機",
    tree: "畫樹",
    tree2: "畫樹二",
    try: "異常處理示例",
    clock: "畫鐘",
    pascal_triangle: "賈憲三角",
    zh_sqrt: "增乘開平方"
  },
  examplesLinks: {
    fizzbuzz: "[1]: https://en.wikipedia.org/wiki/Fizz_buzz",
    quine: "[2]: https://zh.wikipedia.org/wiki/自產生程式"
  }
};


/***/ }),
/* 1 */
/***/ (function(module, exports, __webpack_require__) {

var map = {
	"./beer.wy": 2,
	"./clock.wy": 3,
	"./collatz.wy": 4,
	"./collatz2.wy": 5,
	"./crt.wy": 6,
	"./divination.wy": 7,
	"./draw_heart.wy": 8,
	"./eightqueens.wy": 9,
	"./euclidean.wy": 10,
	"./factorial.wy": 11,
	"./fibonacci.wy": 12,
	"./fibonacci2.wy": 13,
	"./fibonacci_array.wy": 14,
	"./fizzbuzz.wy": 15,
	"./hanoi.wy": 16,
	"./hanoi_stack.wy": 17,
	"./helloworld+.wy": 18,
	"./helloworld.wy": 19,
	"./import.wy": 20,
	"./linglong_tower.wy": 21,
	"./macro.wy": 22,
	"./mandelbrot.wy": 23,
	"./mergesort.wy": 24,
	"./misc.wy": 25,
	"./modinv.wy": 26,
	"./multiplication_table.wy": 27,
	"./nested_fun.wy": 28,
	"./obj.wy": 29,
	"./pascal_triangle.wy": 30,
	"./pi_leibniz.wy": 31,
	"./pi_liuhui.wy": 32,
	"./quicksort.wy": 33,
	"./quicksort_inplace.wy": 34,
	"./quine.wy": 35,
	"./quine2.wy": 36,
	"./selectionsort.wy": 37,
	"./serialization.wy": 38,
	"./sieve.wy": 39,
	"./sqrt_newton.wy": 40,
	"./tree.wy": 41,
	"./tree2.wy": 42,
	"./try.wy": 43,
	"./turing.wy": 44,
	"./zh_sqrt.wy": 45
};


function webpackContext(req) {
	var id = webpackContextResolve(req);
	return __webpack_require__(id);
}
function webpackContextResolve(req) {
	if(!__webpack_require__.o(map, req)) {
		var e = new Error("Cannot find module '" + req + "'");
		e.code = 'MODULE_NOT_FOUND';
		throw e;
	}
	return map[req];
}
webpackContext.keys = function webpackContextKeys() {
	return Object.keys(map);
};
webpackContext.resolve = webpackContextResolve;
module.exports = webpackContext;
webpackContext.id = 1;

/***/ }),
/* 2 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一言。曰「「春日宴。」」。書之。\n有數九。名之曰「酒數」。\n\n恆為是。若「酒數」等於零者乃止也。\n\n\t吾有三言。曰「「與君」」。曰「酒數」。\n\t\t曰「「杯酒。可以窮歡宴。綠酒一杯歌一遍。」」。書之。\n\n減「酒數」以一。昔之「酒數」者。今其是矣云云。\n\n吾有一言。曰「「綠酒千杯腸已爛。」」。書之。");

/***/ }),
/* 3 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「曆法」」之書。方悟「今何紀元時」「彼時何小時」「彼刻何刻」「彼分何分」「彼秒何秒」之義。\n吾嘗觀「「畫譜」」之書。方悟「備紙」「擇筆」「蘸色」「落筆」「運筆」「提筆」「設色」「裱畫」之義。\n吾嘗觀「「算經」」之書。方悟「倍圓周率」「正弦」「餘弦」之義。\n\n施「今何紀元時」。名之曰「紀元時」。\n施「彼時何小時」於「紀元時」。名之曰「小時」。\n施「彼刻何刻」於「紀元時」。名之曰「刻」。\n施「彼分何分」於「紀元時」。名之曰「分」。\n施「彼秒何秒」於「紀元時」。名之曰「秒」。\n\n有數四百。名之曰「紙縱」。\n有數四百。名之曰「紙橫」。\n除二於「紙縱」。名之曰「半縱」。\n除二於「紙橫」。名之曰「半橫」。\n吾有一數。名之曰「比例」。\n\n若「半橫」小於「半縱」者。\n\t昔之「比例」者。今「半橫」是矣。\n若非。\n\t昔之「比例」者。今「半縱」是矣。\n云云。\n\n吾有一術。名之曰「縱坐標」。欲行是術。必先得一數。曰「南」。是術曰。\n\t乘「南」以「比例」。減其於「半縱」。乃得矣。\n是謂「縱坐標」之術也。\n\n吾有一術。名之曰「橫坐標」。欲行是術。必先得一數。曰「東」。是術曰。\n\t乘「東」以「比例」。減其於「半橫」。乃得矣。\n是謂「橫坐標」之術也。\n\n吾有一術。名之曰「極坐標」。欲行是術。必先得二數。曰「距」。曰「角」。是術曰。\n\t施「餘弦」於「角」。乘其以「距」。取一以施「縱坐標」。名之曰「縱」。\n\t施「正弦」於「角」。乘其以「距」。取一以施「橫坐標」。名之曰「橫」。\n\t吾有一物。名之曰「坐標」。其物如是。\n\t\t物之「「橫」」者。數曰「橫」。\n\t\t物之「「縱」」者。數曰「縱」。\n\t是謂「坐標」之物也。乃得「坐標」。\n是謂「極坐標」之術也。\n\n吾有一術。名之曰「畫鐘面」。\n欲行是術。必先得一物。曰「紙」。一數。曰「半徑」。\n是術曰。\n\n\t有數一千零二十四。名之曰「割圓」。\n\t夫「半徑」。夫零。取二以施「極坐標」。名之曰「始坐標」。\n\t夫「紙」。夫「始坐標」之「「橫」」。夫「始坐標」之「「縱」」。取三以施「落筆」。\n\n\t有數一。名之曰「甲」。\n\t為是「割圓」遍。\n\t\t除「甲」以「割圓」。乘其以「倍圓周率」。名之曰「乙」。\n\t\t夫「半徑」。夫「乙」。取二以施「極坐標」。名之曰「坐標」。\n\t\t夫「紙」。夫「坐標」之「「橫」」。夫「坐標」之「「縱」」。取三以施「運筆」。\n\t\t加「甲」以一。昔之「甲」者。今其是矣。\n\t云云。\n\n\t施「蘸色」於「紙」於「「鈦白」」。\n\t施「設色」於「紙」。\n\t施「蘸色」於「紙」於「「黑」」。\n\t施「提筆」於「紙」。\n\n\t有數零。名之曰「丙」。\n\n\t為是六十遍。\n\t\t除「丙」以六十。乘其以「倍圓周率」。名之曰「丁」。\n\t\t夫「半徑」。夫「丁」。取二以施「極坐標」。名之曰「正刻外坐標」。\n\t\t夫「紙」。夫「正刻外坐標」之「「橫」」。夫「正刻外坐標」之「「縱」」。取三以施「落筆」。\n\t\t乘九分五於「半徑」。夫「丁」。取二以施「極坐標」。名之曰「正刻內坐標」。\n\t\t夫「紙」。夫「正刻內坐標」之「「橫」」。夫「正刻內坐標」之「「縱」」。取三以施「運筆」。\n\t\t施「提筆」於「紙」。\n\n\t\t加「丙」以一。昔之「丙」者。今其是矣。\n\t云云。\n\n\n\t有數零。名之曰「丙」。\n\n\t為是十二遍。\n\t\t除「丙」以十二。乘其以「倍圓周率」。名之曰「戊」。\n\t\t夫「半徑」。夫「戊」。取二以施「極坐標」。名之曰「初刻外坐標」。\n\t\t夫「紙」。夫「初刻外坐標」之「「橫」」。夫「初刻外坐標」之「「縱」」。取三以施「落筆」。\n\t\t乘八分五於「半徑」。夫「戊」。取二以施「極坐標」。名之曰「初刻內坐標」。\n\t\t夫「紙」。夫「初刻內坐標」之「「橫」」。夫「初刻內坐標」之「「縱」」。取三以施「運筆」。\n\t\t施「提筆」於「紙」。\n\n\t\t加「丙」以一。昔之「丙」者。今其是矣。\n\t云云。\n\n是謂「畫鐘面」之術也。\n\n吾有一術。名之曰「畫指針」。\n欲行是術。必先得一物。曰「紙」。五數。曰「角」。曰「針長」。曰「尾長」。曰「針角」。曰「尾角」。\n是術曰。\n\n\t夫「針長」。加「針角」於「角」。取二以施「極坐標」。名之曰「甲」。\n\t乘負一於「尾長」。減「尾角」於「角」。取二以施「極坐標」。名之曰「乙」。\n\t乘負一於「尾長」。加「尾角」於「角」。取二以施「極坐標」。名之曰「丙」。\n\t夫「針長」。減「針角」於「角」。取二以施「極坐標」。名之曰「丁」。\n\n\t夫「紙」。夫「甲」之「「橫」」。夫「甲」之「「縱」」。取三以施「落筆」。\n\t夫「紙」。夫「乙」之「「橫」」。夫「乙」之「「縱」」。取三以施「運筆」。\n\t夫「紙」。夫「丙」之「「橫」」。夫「丙」之「「縱」」。取三以施「運筆」。\n\t夫「紙」。夫「丁」之「「橫」」。夫「丁」之「「縱」」。取三以施「運筆」。\n\t夫「紙」。夫「甲」之「「橫」」。夫「甲」之「「縱」」。取三以施「運筆」。\n\n\t施「蘸色」於「紙」於「「花青」」。\n\t施「設色」於「紙」。\n\n是謂「畫指針」之術也。\n\n吾有一術。名之曰「执笔」。是術曰。\n\n\t施「(()=>document.getElementById(\"out\").innerHTML=\"\")」。\n\t施「今何紀元時」。名之曰「紀元時」。\n\t施「彼時何小時」於「紀元時」。名之曰「時」。\n\t施「彼分何分」於「紀元時」。名之曰「分」。\n\t施「彼刻何刻」於「紀元時」。名之曰「刻」。\n\t施「彼秒何秒」於「紀元時」。名之曰「秒」。\n\n\t乘「刻」以十五。加其於「分」。昔之「分」者。今其是矣。\n\n\t除「秒」以六十。加其於「分」。昔之「分」者。今其是矣。\n\t除「分」以六十。加其於「時」。昔之「時」者。今其是矣。\n\n\t除「分」以六十。乘其以「倍圓周率」。乘其以負一。名之曰「分角」。\n\t除「時」以十二。乘其以「倍圓周率」。乘其以負一。名之曰「時角」。\n\t除「秒」以六十。乘其以「倍圓周率」。乘其以負一。名之曰「秒角」。\n\n\n\t施「備紙」於「紙橫」。於「紙縱」。名之曰「紙」。\n\t施「畫鐘面」於「紙」。於九分。\n\t施「畫指針」於「紙」。於「秒角」。於八分。於一分。於三毫。於一分。\n\t施「畫指針」於「紙」。於「分角」。於七分五釐。於一分。於三毫。於三分。\n\t施「畫指針」於「紙」。於「時角」。於五分五釐。於八釐。於五毫。於五分。\n\t施「裱畫」於「紙」於「「out」」。\n\n是謂「执笔」之術也。\n\n施「(x=>setInterval(x, 500))」於「执笔」。");

/***/ }),
/* 4 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「角谷猜想」。\n欲行是術。必先得一數。\n曰「甲」。\n乃行是術曰。\n\t吾有一術。名之曰「助手」。\n\t欲行是術。必先得一數。\n\t曰「乙」。\n\t乃行是術曰。\n\t\t吾有一數。名之曰「埃」。\n\t\t除「乙」以二。所餘幾何。名之曰「積」。\n\t\t若「積」不等於零者。乘三以「乙」。加其於一。昔之「埃」者。今其是矣。\n\t\t若非。 除二於「乙」。昔之「埃」者。今其是矣。云云。\n\t\t乃得「埃」。\n\t是謂「助手」之術也。\n\n\t吾有一列。名之曰「回」。充「回」以「甲」。\n\t恆為是。\n\t\t若「甲」等於一者。乃止。也。\n\t\t施「助手」於「甲」。昔之「甲」者。今其是矣。\n\t\t充「回」以「甲」。\n\t云云。\n\t充「回」以一。\n\t乃得「回」。\n是謂「角谷猜想」之術也。\n\n施「角谷猜想」於十二。書之。\n施「角谷猜想」於十九。書之。\n施「角谷猜想」於二十七。書之。");

/***/ }),
/* 5 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「考拉茲」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t有數零。名之曰「總」。\n\t為是九千九百九十九遍。\n\t\t若「甲」等於一者。乃得「總」。\n\t\t若非。\n\t\t\t除「甲」以二。所餘幾何。名之曰「丙」。\n\t\t\t若「丙」等於零者。除「甲」以二。名之曰「半」。昔之「甲」者。今「半」也。\n\t\t\t若非。\n\t\t\t\t乘「甲」以三。名之曰「丁」。加一於「丁」。名之曰「戊」。昔之「甲」者。今「戊」是也。\n\t\t\t加「總」以一。名之曰「己」。\n\t\t\t昔之「總」者。今「己」是也。\n\t云云。\n是謂「考拉茲」之術也。\n\n\n施「考拉茲」於一十八。書之。\n施「考拉茲」於一百二十三。書之。\n施「考拉茲」於九百七十八。書之。\n施「考拉茲」於六。書之。\n");

/***/ }),
/* 6 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「大衍總數」。欲行是術。必先得二列。曰「諸元」。曰「諸餘」。乃行是術曰。\n注曰「「\n\t以定相乘為衍母。\n\t以各定約衍母。得各衍數。\n\t諸衍數。各滿定母去之。不滿曰奇。\n\t以奇與定。用大衍求一入之。以求乘率。\n\t置各乘率。對乘衍數。得用。\n\t以其餘各乘用。為各總。\n\t併總。滿衍母去之。不滿。為所求率數。\n」」\n\n\t施「求諸定」於「諸元」。名之曰「諸定」。\n\n\t施「相乘」於「諸定」。名之曰「衍母」。\n\t注曰「「衍母者。即諸定數皆能度盡之數也」」。\n\n\t吾有一列。名之曰「諸總」。\n\t夫「諸定」之長。名之曰「量」。\n\t有數〇。名之曰「序」。恆為是。若「序」等於「量」者乃止也。\n\t\t加「序」以一。昔之「序」者。今其是矣。\n\t\t夫「諸定」之「序」。名之曰「定」。\n\t\t夫「諸餘」之「序」。名之曰「餘」。\n\t\t若「定」等於一者乃止是遍也。\n\t\t注曰「「定數一者。即無用數」」。\n\n\t\t除「衍母」以「定」。名之曰「衍」。\n\t\t注曰「「衍數者。即諸數度盡一數度不盡之數也」」。\n\n\t\t除「衍」以「定」。所餘幾何。名之曰「奇」。\n\t\t注曰「「奇數者。定數度衍數不盡之數也」」。\n\n\t\t施「大衍求一」於「奇」於「定」。名之曰「果」。\n\t\t夫「果」之「「乘率」」。名之曰「乘率」。\n\n\t\t乘「衍」以「乘率」。名之曰「用」。\n\t\t注曰「「用數者。即一數餘一諸數度盡之數也」」。\n\n\t\t乘「用」以「餘」。名之曰「總」。充「諸總」以「總」。\n\t\t注曰「「蓋用數為諸數度盡一數餘一之數。以幾數乘之。必為諸數度盡一數餘幾數之數也」」。\n\t云云。\n\n\t施「相加」於「諸總」。除其以「衍母」。所餘幾何。名之曰「率」。\n\t注曰「「併各條而以各數度之。必各數仍餘。幾數也餘。數悉合。則總數必合矣」」。\n\t乃得「率」。\n是謂「大衍總數」之術也。\n\n注曰「「\n\t然衍母為諸數度盡之數。累加一衍母眾餘數皆不變。\n\t故滿衍母去之。得在衍母內者。\n\t其數最小為第一。數若大於此數者。遞加一衍母數。無不合者。\n」」\n\n\n吾有一術。名之曰「求諸定」。欲行是術。必先得一列。曰「諸元」。乃行是術曰。\n注曰「「\n\t元數者。先以兩兩連環求等。\n\t約奇弗約偶。\n\t或約得五。而彼有十。乃約偶而弗約奇。\n\t或元數俱偶。約畢可存一位見偶。\n\t或皆約而猶有類數存。姑置之。俟與其他約遍。而後乃與姑置者求等約之。\n\t或諸數皆不可盡類。則以諸元數命曰定數。\n」」\n\n\t夫「諸元」之長。名之曰「量」。\n\t有數〇。名之曰「甲序」。恆為是。若「甲序」等於「量」者乃止也。\n\t\t加「甲序」以一。昔之「甲序」者。今其是矣。\n\n\t\t有數〇。名之曰「乙序」。恆為是。若「乙序」等於「量」者乃止也。\n\t\t\t加「乙序」以一。昔之「乙序」者。今其是矣。\n\t\t\t若「乙序」等於「甲序」者乃止是遍也。\n\n\t\t\t夫「諸元」之「甲序」。名之曰「甲」。\n\t\t\t夫「諸元」之「乙序」。名之曰「乙」。\n\t\t\t施「大衍求一」於「甲」於「乙」。名之曰「果」。\n\t\t\t夫「果」之「「等數」」。名之曰「等」。\n\n\t\t\t除「甲」以「等」。名之曰「約甲」。\n\t\t\t除「乙」以「等」。名之曰「約乙」。\n\t\t\t除「約甲」以「等」。所餘幾何。若其不等於〇者。\n\t\t\t\t昔之「諸元」之「甲序」者。今「約甲」是矣。\n\t\t\t若非。\n\t\t\t\t昔之「諸元」之「乙序」者。今「約乙」是矣也。\n\t云云。云云。\n\t乃得「諸元」。\n是謂「求諸定」之術也。\n\n吾有一術。名之曰「相乘」。欲行是術。必先得一列。曰「諸數」。乃行是術曰。\n\t有數一。名之曰「積」。\n\t凡「諸數」中之「數」。乘「積」以「數」。昔之「積」者。今其是矣。云云。\n\t乃得「積」。\n是謂「相乘」之術也。\n吾有一術。名之曰「相加」。欲行是術。必先得一列。曰「諸數」。乃行是術曰。\n\t有數〇。名之曰「和」。\n\t凡「諸數」中之「數」。加「和」以「數」。昔之「和」者。今其是矣。云云。\n\t乃得「和」。\n是謂「相加」之術也。\n\n吾有一術。名之曰「大衍求一」。欲行是術。必先得二數。曰「奇」。曰「定」。乃行是術曰。\n注曰「「\n\t大衍求一術云。\n\t置奇右上。定居右下。立天元一於左上。\n\t先以右上除右下。所得商數與左上一相生。入左下。然後乃以右行上下。\n\t以少除多。遞互除之。所得商數隨即遞互累乘。歸左行上下。\n\t須使右上末後奇一而止。乃驗左上所得。以為乘率。\n\t或奇數已見單一者。便為乘率。\n」」\n\t若「奇」等於〇者。\n\t\t吾有一物。名之曰「果」。其物如是。\n\t\t\t物之「「乘率」」者。數曰〇。\n\t\t\t物之「「等數」」者。數曰「定」。\n\t\t是謂「果」之物也。\n\t\t乃得「果」也。\n\t若「奇」等於一者。\n\t\t吾有一物。名之曰「果」。其物如是。\n\t\t\t物之「「乘率」」者。數曰一。\n\t\t\t物之「「等數」」者。數曰一。\n\t\t是謂「果」之物也。\n\t\t乃得「果」也。\n\n\t有數一。名之曰「天元」。\n\t吾有四數。曰「奇」曰「定」曰「天元」曰〇。\n\t\t名之曰「右上」曰「右下」曰「左上」曰「左下」。\n\n\t恆為是。\n\t\t若「右上」等於一者。乃止也。\n\n\t\t除「右下」以「右上」。所餘幾何。名之曰「餘」。\n\t\t減「右下」以「餘」。除其以「右上」。名之曰「商」。\n\t\t乘「商」以「左上」。加「左下」以其。昔之「左下」者。今其是矣。\n\t\t昔之「右下」者。今「餘」是矣。\n\n\t\t若「右下」等於〇者。乃止也。\n\n\t\t減「右上」以一。除其以「右下」。所餘幾何。加其以一。名之曰「餘」。\n\t\t減「右上」以「餘」。除其以「右下」。名之曰「商」。\n\t\t乘「商」以「左下」。加「左上」以其。昔之「左上」者。今其是矣。\n\t\t昔之「右上」者。今「餘」是矣。\n\t云云。\n\n\t吾有一物。名之曰「果」。其物如是。\n\t\t物之「「乘率」」者。數曰「左上」。\n\t\t物之「「等數」」者。數曰「右上」。\n\t是謂「果」之物也。\n\t注曰「「右上者等數也。若右下等於〇者。曰奇數與定數不互素。無乘率也。」」\n\t若「右下」等於〇者。昔之「果」之「「乘率」」者。今〇是矣也。\n\t乃得「果」。\n是謂「大衍求一」之術也。\n\n\n\n吾有一術。名之曰「置諸問」。欲行是術。必先得二列。曰「諸元」曰「諸餘」。二數。曰「元」曰「餘」。乃行是術曰。\n\t充「諸元」以「元」。\n\t充「諸餘」以「餘」。\n是謂「置諸問」之術也。\n\n或云「「有物不知其數」」。\n蓋謂「「吾有二列。名之曰「諸元」曰「諸餘」。施「置諸問」於「諸元」於「諸餘」。名之曰「置問」」」。\n\n或云「「以「甲」數之剩「乙」也」」。\n蓋謂「「施「置問」於「甲」於「乙」。名之曰「各問」」」。\n\n或云「「問物幾何」」。\n蓋謂「「施「大衍總數」於「諸元」於「諸餘」」」。\n\n有物不知其數。以三數之剩二也。以五數之剩三也。問物幾何。書之。\n有物不知其數。以三數之剩二也。以五數之剩三也。以七數之剩二也。問物幾何。書之。\n有物不知其數。以八四數之剩二三也。以一六〇數之剩七也。以六三數之剩二也。問物幾何。書之。\n有物不知其數。以三二數之剩七也。以九數之剩二也。以五數之剩二也。以七數之剩二也。問物幾何。書之。\n");

/***/ }),
/* 7 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「易經」」之書。方悟「占」「運」之義。\n吾嘗觀「「算經」」之書。方悟「取底」之義。\n\n施「運」於十三。\n\n吾有一術。名之曰「听天由命」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t施「占」。名之曰「乙」。乘「甲」以「乙」。名之曰「丙」。施「取底」於「丙」。乃得其。\n是謂「听天由命」之術也。\n\n吾有一術。名之曰「春秋古筮法」。欲行是術。必先得一數。曰「现余策」。乃行是術曰。\n\t吾有一數。曰零。名之曰「左余策」。\n\t吾有一數。曰零。名之曰「左剩策」。\n\t吾有一數。曰零。名之曰「右余策」。\n\t吾有一數。曰零。名之曰「右剩策」。\n\n\t減「现余策」以一。名之曰「现余策」。\n\n\t減「现余策」以一。\n\t昔之「现余策」者。今其是矣。\n\t施「听天由命」於「现余策」。\n\t昔之「左余策」者。今其是矣。\n\t加「现余策」以一。\n\t昔之「现余策」者。今其是矣。\n\t加「左余策」以一。\n\t昔之「左余策」者。今其是矣。\n\n\t減「现余策」以「左余策」。\n\t昔之「右余策」者。今其是矣。\n\t批曰。「「分而为二以象两」」\n\n\t除「左余策」以四。所餘幾何。批曰。「「揲之以四象四时」」\n\t昔之「左剩策」者。今其是矣。\n\t若「左剩策」等於零者。\n\t\t昔之「左剩策」者。今四是矣。\n\t云云。\n\t除「右余策」以四。所餘幾何。\n\t昔之「右剩策」者。今其是矣。\n\t若「右剩策」等於零者。\n\t\t昔之「右剩策」者。今四是矣。\n\t云云。\n\n\t減「现余策」以「左剩策」。\n\t昔之「现余策」者。今其是矣。\n\t減「现余策」以「右剩策」。\n\t昔之「现余策」者。今其是矣。\n\t乃得 「现余策」。\n\n是謂「春秋古筮法」之術也。\n\n吾有一列。名之曰「爻基」。\n吾有一數。曰六。名之曰「甲」。\n恆為是。\n\t若「甲」等於零者。乃止。云云。\n\t吾有一數。曰五十。名之曰「余策」。批曰。「「大衍之数五十」」\n\t減「余策」以一。昔之「余策」者。今其是矣。批曰。「「其用四十有九」」\n\t為是三遍。批曰。「「三变成一爻」」\n\t\t施「春秋古筮法」於「余策」\n\t\t昔之「余策」者。今其是矣。\n\t云云。\n\t充「爻基」以「余策」。\n\t減「甲」以一。\n\t昔之「甲」者。今其是矣。\n云云。\n\n昔之「甲」者。今六是矣。\n吾有一數。曰零。名之曰「判據」。\n恆為是。\n\t若「甲」等於零者。乃止。云云。\n\n\t夫「爻基」之「甲」。除其以四。\n\t除其以二。所餘幾何。\n\t昔之「判據」者。今其是矣。\n\n\t若「判據」等於零者。\n\t\t吾有一言。曰「「-- --」」。書之。\n\t若非\n\t\t吾有一言。曰「「-----」」。書之。\n\t云云。\n\n\t減「甲」以一。\n\t昔之「甲」者。今其是矣。\n云云。");

/***/ }),
/* 8 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「算經」」之書。方悟「絕對」「平方根」之義。\n\n吾有一術名之曰「畫心」。\n欲行是術。必先得一言。曰「心語」。\n乃行是術曰。\n\t夫「心語」之長。名之曰「長度」。\n\t吾有一言。曰「「一」」。名之曰「填充符」。\n\t吾有一言。曰「「\\n」」。名之曰「换行符」。\n\t除十三以十。名之曰「乙」。\n\t除負十一以十。名之曰「乙止」。\n\t除四十以一千。名之曰「甲步長」。\n\t除六以一百。名之曰「乙步長」。\n\t吾有一數。曰一。名之曰「輸出位置」。\n\t吾有一言。曰「「」」。名之曰「果」。\n\t恆為是。若「乙」小於「乙止」者乃止也。\n\t\t除負十一以十。名之曰「甲」。\n\t\t除十一以十。名之曰「甲止」。\n\t\t吾有一言。曰「「」」。名之曰「本行」。\n\t\t恆為是。若「甲」大於「甲止」者乃止也。\n\t\t\t施「絕對」於「甲」。名之曰「甲絕對」。\n\t\t\t施「平方根」於「甲絕對」。名之曰「減數」。\n\t\t\t乘五於「乙」。除其以四。名之曰「被減數」。\n\t\t\t減「被減數」以「減數」。名之曰「差」。\n\t\t\t乘「差」以「差」。名之曰「加數」。\n\t\t\t乘「甲」以「甲」。加其以「加數」。減其以一。名之曰「函數值」。\n\t\t\t若「函數值」不大於零者。\n\t\t\t\t夫「心語」之「輸出位置」。名之曰「字」。\n\t\t\t\t加「本行」以「字」。昔之「本行」者今其是矣。\n\t\t\t\t除「輸出位置」以「長度」。所餘幾何。加其以一。昔之「輸出位置」者今其是矣。\n\t\t\t若非。\n\t\t\t\t加「本行」以「填充符」。昔之「本行」者今其是矣。\n\t\t\t终也。\n\t\t\t加「甲」以「甲步長」。昔之「甲」者今其是矣。\n\t\t云云。\n\t\t減「乙」以「乙步長」。昔之「乙」者今其是矣。\n\t\t加「本行」以「换行符」。昔之「本行」者今其是矣。\n\t\t加「果」以「本行」。昔之「果」者今其是矣。\n\t云云。\n\t吾有一言。曰「果」。書之。\n是謂「畫心」之術也。\n\n施「畫心」於「「琉璃梳子撫青絲。畫心牽腸癡不癡。」」。");

/***/ }),
/* 9 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("注曰。「「今以八皇后置棋盤之上而不相殺。其法幾何。」」\n\n吾有一術。名之曰「皇后問題」。欲行是術。必先得一數。曰「寬」。乃行是術曰。\n\t吾有一列。名之曰「棋盤」。\n\n\t吾有一術。名之曰「單步」。是術曰。\n\t\t若「棋盤」之長等於「寬」者。\n\t\t\t夫「棋盤」書之。\n\t\t若非。\n\t\t\t吾有一數。曰一。名之曰「此后」。\n\t\t\t為是「寬」遍。\n\t\t\t\t吾有一爻。曰陽。名之曰「可乎」。\n\t\t\t\t吾有一數。曰一。名之曰「彼后之位」。\n\t\t\t\t夫「棋盤」之長。名之曰「幾何」。\n\t\t\t\t加一於「幾何」。名之曰「此后之位」。\n\t\t\t\t為是「幾何」遍。\n\t\t\t\t\t夫「棋盤」之「彼后之位」。名之曰「彼后」。\n\t\t\t\t\t減「此后之位」以「彼后之位」。名之曰「直距」。\n\t\t\t\t\t減「彼后」以「此后」。名之曰「右距」。\n\t\t\t\t\t減「彼后」於「此后」。名之曰「左距」。\n\t\t\t\t\t若「彼后」等於「此后」者。昔之「可乎」者。今陰也。乃止。也。\n\t\t\t\t\t若「右距」等於「直距」者。昔之「可乎」者。今陰也。乃止。也。\n\t\t\t\t\t若「左距」等於「直距」者。昔之「可乎」者。今陰也。乃止。也。\n\t\t\t\t\t加一於「彼后之位」。名之曰「新位」。\n\t\t\t\t\t昔之「彼后之位」者。今「新位」也。\n\t\t\t\t云云。\n\t\t\t\t若「可乎」者。\n\t\t\t\t\t吾有一列。銜其以「棋盤」。名之曰「舊棋盤」\n\t\t\t\t\t充「棋盤」以「此后」。\n\t\t\t\t\t施「單步」。噫。\n\t\t\t\t\t昔之「棋盤」者。今「舊棋盤」是矣。\n\t\t\t\t也。\n\t\t\t\t加一於「此后」。名之曰「新此后」。\n\t\t\t\t昔之「此后」者。今「新此后」也。\n\t\t\t云云。\n\t\t也。\n\t是謂「單步」之術也。\n\n\t施「單步」。\n是謂「皇后問題」之術也。\n　\n施「皇后問題」於八。噫。\n");

/***/ }),
/* 10 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「歐幾里得法」。\n欲行是術。必先得二數。\n曰「甲」。曰「乙」。\n乃行是術曰。\n\t\t吾有一數。名之曰「回」。\n\t\t若「乙」等於零者，乃得「甲」是矣。\n\t\t若非，\n\t\t\t吾有一數。名之曰「削除」。\n\t\t\t除「甲」以「乙」所餘幾何。昔之「削除」者。今其是矣。\n\t\t\t施「歐幾里得法」於「乙」。於「削除」。昔之「回」者。今其是矣。\n\t\t也。\n\t\t乃得「回」。\n是謂「歐幾里得法」之術也。\n\n吾有一術。名之曰「互質」。\n欲行是術。必先得二數。\n曰「甲」。曰「乙」。\n乃行是術曰。\n\t\t吾有一數。名之曰「回」。\n\t\t施「歐幾里得法」於「甲」。於「乙」。昔之「回」者。今其是矣。\n\t\t若「回」等於一者，乃得陽。若非，乃得陰。也。\n是謂「互質」之術也。\n\n吾有一術。名之曰「歐拉餘數」。\n欲行是術。必先得一數。\n曰「甲」。\n乃行是術曰。\n\t注曰。「「非最優解矣。吾算術及數論廢也」」\n\t吾有二數。曰二。曰一。名之曰「埃」。曰「積」。注曰。「「曰「畸」」」\n\t恆為是。\n\t\t若「甲」不大於「埃」者。乃止。也。\n\t\t吾有一爻。名之曰「回」。\n\t\t施「互質」於「甲」。於「埃」。昔之「回」者。今其是矣。\n\t\t若「回」者，加「積」以一。名之曰「積」。也。\n\t\t加「埃」以一。名之曰「埃」。\n\t云云。\n\t乃得「積」。\n是謂「歐拉餘數」之術也。\n\n施「歐幾里得法」於一千零七十一於四百六十二。書之。\n施「歐幾里得法」於一百二十三於四。書之。\n\n施「互質」於一百二十三於四。書之。\n施「互質」於四於二。書之。\n\n施「歐拉餘數」於二。書之。\n施「歐拉餘數」於十二。書之。\n施「歐拉餘數」於十三。書之。\n施「歐拉餘數」於十六。書之。\n施「歐拉餘數」於二百五十五。書之。");

/***/ }),
/* 11 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「階乘」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t若「甲」等於一者。\n\t\t乃得「甲」。\n\t若非。\n\t\t減「甲」以一。名之曰「乙」。\n\t\t施「階乘」於「乙」。名之曰「丙」。\n\t\t乘「丙」以「甲」。名之曰「丁」。\n\t\t乃得「丁」\n\t也。\n是謂「階乘」之術也。\n\n施「階乘」於五。書之。");

/***/ }),
/* 12 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「斐波那契」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t若「甲」等於零者乃得零也\n\t若「甲」等於一者乃得一也\n\t減「甲」以一。減「甲」以二。名之曰「乙」。曰「丙」。\n\t施「斐波那契」於「乙」。名之曰「丁」。\n\t施「斐波那契」於「丙」。名之曰「戊」。\n\t加「丁」以「戊」。名之曰「己」。\n\t乃得「己」。\n是謂「斐波那契」之術也。\n\n施「斐波那契」於十二。書之。");

/***/ }),
/* 13 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「斐氏列」。\n\n欲行是術。必先得一數。曰「因」。乃行是術曰。\n\t\t有數零。名之曰「頭」。\n\t有數一。名之曰「尾」。\n\t\t有數一。名之曰「計」。\n\t有數零。名之曰「果」。\n\n\t若「因」等於零者。昔之「果」者。今「因」是矣云云。\n\t若「因」等於一者。昔之「果」者。今「因」是矣云云。\n\n\t\t恆為是。若「計」不小於「因」者乃止也。\n\t\t\t\t加「頭」以「尾」。昔之「果」者。今其是矣。\n\t\t\t\t昔之「頭」者。今「尾」是矣。\n\t\t\t\t昔之「尾」者。今「果」是矣。\n\t\t\t\t加「計」以一。昔之「計」者。今其是矣。\n\t\t云云。\n\n\t\t乃得「果」\n是謂「斐氏列」之術也。\n\n施「斐氏列」於十。書之。\n");

/***/ }),
/* 14 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「斐氏列」。\n欲行是術。必先得一數。曰「限」。乃行是術曰。\n\t有數零。名之曰「計」。\n\t吾有一列。名之曰「斐氏列」。\n\t為是「限」遍。\n\t\t若「計」小於二者。\n\t\t\t充「斐氏列」以「計」。\n\t\t若非。\n\t\t\t減「計」以一。名之曰「計前」。\n\t\t\t夫「斐氏列」之「計前」。名之曰「甲」。\n\t\t\t夫「斐氏列」之「計」。名之曰「乙」。\n\t\t\t加「甲」以「乙」。名之曰「新數」。\n\t\t\t充「斐氏列」以「新數」。\n\t\t云云。\n\t\t加「計」以一。昔之「計」者。今其是也。\n\t乃得「斐氏列」矣。\n是謂「斐氏列」之術也。\n\n施「斐氏列」於二十。書之。\n");

/***/ }),
/* 15 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("有數一。名之曰「戊」。恆為是。\n\n\t除「戊」以三。所餘幾何。變其。名之曰「三餘」。\n\t除「戊」以五。所餘幾何。變其。名之曰「五餘」。\n\n\t夫「三餘」「五餘」中有陽乎。變其。名之曰「寂」。\n\t若「寂」者。吾有一言。曰「戊」。書之。\n\t若非。\n\t\t吾有一言。名之曰「聲」。\n\t\t若「三餘」者。加「聲」以「「黃河流水鳴濺濺。」」。昔之「聲」者。今其是矣。云云。\n\t\t若「五餘」者。加「聲」以「「燕山胡騎鳴啾啾。」」。昔之「聲」者。今其是矣。云云。\n\t\t吾有一言。曰「聲」。書之。\n\t云云。\n\n\t若「戊」等於一百者乃止也。\n加一以「戊」。昔之「戊」者。今其是矣云云。");

/***/ }),
/* 16 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「漢諾塔」。欲行是術。必先得四數。曰「盤數」。曰「甲塔」。曰「乙塔」。曰「丙塔」。\n乃行是術曰。\n\t若「盤數」等於零者。吾有一列。乃得其也。\n\t減「盤數」以一。昔之「盤數」者。今其是矣。\n\t施「漢諾塔」於「盤數」。於「甲塔」。於「丙塔」。於「乙塔」。名之曰「古」。\n\t施「漢諾塔」於「盤數」。於「丙塔」。於「乙塔」。於「甲塔」。名之曰「後」。\n\t吾有一列。名之曰「步」。充「步」以「甲塔」。以「乙塔」。\n\t吾有一列。名之曰「今」。充「今」以「步」。\n\t銜「古」以「今」以「後」。名之曰「史」。乃得「史」。\n是謂「漢諾塔」之術也。\n\n吾有一術。名之曰「畫塔法」。欲行是術。必先得一數。曰「盤數」。一列。曰「史」。\n乃行是術曰。\n\t吾有一言。曰「「甲乙丙」」。名之曰「諸名」。\n\t吾有一列。名之曰「三塔」。充「三塔」以「盤數」。以零。以零。\n\n\t吾有一術。名之曰「畫」。是術曰。\n\t\t有數一。名之曰「戌」。恆為是。若「戌」大於三者乃止也。\n\t\t\t夫「三塔」之「戌」。名之曰「碟」。\n\t\t\t減「盤數」以「碟」。名之曰「柱」。\n\t\t\t吾有一言。名之曰「行」。\n\t\t\t為是「碟」遍。加「行」以「「盤」」。昔之「行」者。今其是矣。云云。\n\t\t\t為是「柱」遍。加「行」以「「一」」。昔之「行」者。今其是矣。云云。\n\t\t\t夫「諸名」之「戌」。名之曰「名」。\n\t\t\t吾有四言。曰「「〔」」。曰「名」。曰「「〕」」。曰「行」。書之。\n\t\t加一以「戌」。昔之「戌」者。今其是矣云云。\n\t\t書之。\n\t是謂「畫」之術也。\n\n\t凡「史」中之「步」\n\t\t施「畫」噫。\n\t\t夫「步」之一。名之曰「起」\n\t\t夫「步」之二。名之曰「訖」\n\t\t夫「三塔」之「起」。減其以一。昔之「三塔」之「起」者。今其是矣。\n\t\t夫「三塔」之「訖」。加其以一。昔之「三塔」之「訖」者。今其是矣。\n\t\t書之。\n\t云云。\n\t施「畫」噫。\n\t吾有一言。曰「「畢」」。書之。\n是謂「畫塔法」之術也。\n\n\n有數四。名之曰「盤數」\n施「漢諾塔」於「盤數」。於一。於二。於三。名之曰「史」。\n施「畫塔法」於「盤數」。於「史」。");

/***/ }),
/* 17 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「漢諾塔」。\n欲行是術。必先得四數。曰「盤數」。曰「起」。曰「過」。曰「訖」。乃行是術曰。\n\t吾有五言。曰「「天竺有一漢諾塔。初置」」。曰「盤數」。曰「「金盤於柱」」。曰「起」。曰「「。」」。書之。\n\t吾有五言。曰「「欲盡其過」」。曰「過」。曰「「移至」」。曰「訖」。曰「「。」」。書之。\n\t施「三柱初始」於「盤數」。於「起」。於「過」。於「訖」。\n\t吾有一列。名之曰「棧」。\n\t吾有一列。名之曰「史」。\n\t有數零。名之曰「步數」。\n\t施「新步元」於「盤數」。於「起」。於「過」。於「訖」。名之曰「外元」。\n\t恆為是。\n\t\t夫「棧」之長。變其。名之曰「棧空」。\n\t\t夫「外元」之「「盤數」」。變其。名之曰「外元盤零」。\n\t\t夫「外元盤零」「棧空」中無陰乎。名之曰「當止」。\n\t\t若「當止」者乃止也。\n\t\t施「鏡步元」於「外元」。名之曰「內元」。\n\t\t恆為是。\n\t\t\t若「內元」之「「盤數」」不大於零者乃止也。\n\t\t\t施「入棧」於「棧」。於「內元」。\n\t\t\t夫「內元」之「「盤數」」者。減其以一。昔之「內元」之「「盤數」」者。今其是矣。\n\t\t\t夫「內元」之「「過」」者。名之曰「臨甲」。\n\t\t\t昔之「內元」之「「過」」者。今「內元」之「「訖」」是矣。\n\t\t\t昔之「內元」之「「訖」」者。今「臨甲」是矣。\n\t\t云云。\n\t\t施「首元」於「棧」。名之曰「外元」。\n\t\t施「出棧」於「棧」。昔之「棧」者。今其是矣。\n\t\t吾有一列。名之曰「步」。\n\t\t夫「外元」之「「起」」。名之曰「步起」。\n\t\t夫「外元」之「「訖」」。名之曰「步訖」。\n\t\t充「步」以「步起」。以「步訖」。\n\t\t加「步數」以一。昔之「步數」者。今其是矣。\n\t\t施「書步」於「步數」。於「步」。\n\t\t施「三柱更新」於「步」。\n\t\t施「畫步」。\n\t\t夫「外元」之「「盤數」」者。減其以一。昔之「外元」之「「盤數」」者。今其是矣。\n\t\t夫「外元」之「「起」」者。名之曰「臨乙」。\n\t\t昔之「外元」之「「起」」者。今「外元」之「「過」」是矣。\n\t\t昔之「外元」之「「過」」者。今「臨乙」是矣。\n\t云云。\n\t吾有三言。曰「「噫。吁嚱。共步」」。曰「步數」。曰「「也。」」。書之。\n\t書之。\n是謂「漢諾塔」之術也。\n\n今有一物。名之曰「三柱」。其物如是。\n\t物之「「柱名」」者。列曰零。\n\t物之「「起」」者。數曰零。\n\t物之「「過」」者。數曰零。\n\t物之「「訖」」者。數曰零。\n是謂「三柱」之物也。\n\n吾有一物。名之曰「步元」。其物如是。\n\t物之「「盤數」」者。數曰零。\n\t物之「「起」」者。元曰零。\n\t物之「「過」」者。元曰零。\n\t物之「「訖」」者。元曰零。\n是謂「步元」之物也。\n\n今有一術。名之曰「三柱初始」。欲行是術。必先得四數。曰「盤數」。曰「起」。曰「過」。曰「訖」。乃行是術曰。\n\t夫「盤數」。昔之「三柱」之「「起」」者。今其是矣。\n\t吾有一列。名之曰「柱名」。\n\t充「柱名」以「起」。以「過」。以「訖」。\n\t夫「柱名」。昔之「三柱」之「「柱名」」者。今其是矣。\n是謂「三柱更新」之術也。\n\n今有一術。名之曰「三柱更新」。欲行是術。必先得一列。曰「步」。乃行是術曰。\n\t夫「步」之一者。名之曰「步起」。\n\t夫「步」之二者。名之曰「步訖」。\n\t夫「三柱」之「「柱名」」者。名之曰「柱名」。\n\t夫「柱名」之一。名之曰「起柱名」。\n\t夫「柱名」之二。名之曰「過柱名」。\n\t夫「柱名」之三。名之曰「訖柱名」。\n\t若「步起」等於「起柱名」者。夫「三柱」之「「起」」者。減其以一。昔之「三柱」之「「起」」者。今其是矣云云。\n\t若「步起」等於「過柱名」者。夫「三柱」之「「過」」者。減其以一。昔之「三柱」之「「過」」者。今其是矣云云。\n\t若「步起」等於「訖柱名」者。夫「三柱」之「「訖」」者。減其以一。昔之「三柱」之「「訖」」者。今其是矣云云。\n\t若「步訖」等於「起柱名」者。夫「三柱」之「「起」」者。加其以一。昔之「三柱」之「「起」」者。今其是矣云云。\n\t若「步訖」等於「過柱名」者。夫「三柱」之「「過」」者。加其以一。昔之「三柱」之「「過」」者。今其是矣云云。\n\t若「步訖」等於「訖柱名」者。夫「三柱」之「「訖」」者。加其以一。昔之「三柱」之「「訖」」者。今其是矣云云。\n是謂「三柱更新」之術也。\n\n吾有一術。名之曰「新步元」。欲行是術。必先得一數。曰「盤數」。三元。曰「起」。曰「過」。曰「訖」。乃行是術曰。\n\t吾有一物。名之曰「新元」。\n\t昔之「新元」之「「盤數」」者。今「盤數」矣。\n\t昔之「新元」之「「起」」者。今「起」矣。\n\t昔之「新元」之「「過」」者。今「過」矣。\n\t昔之「新元」之「「訖」」者。今「訖」矣。\n\t乃得「新元」矣。\n是謂「新步元」之術也。\n\n吾有一術。名之曰「鏡步元」。欲行是術。必先得一物。曰「步元」。乃行是術曰。\n\t吾有一物。名之曰「新元」。\n\t夫「步元」之「「盤數」」。\n\t昔之「新元」之「「盤數」」者。今其是矣。\n\t夫「步元」之「「起」」。\n\t昔之「新元」之「「起」」者。今其是矣。\n\t夫「步元」之「「過」」。\n\t昔之「新元」之「「過」」者。今其是矣。\n\t夫「步元」之「「訖」」。\n\t昔之「新元」之「「訖」」者。今其是矣。\n\t乃得「新元」矣。\n是謂「鏡步元」之術也。\n\n吾有一術。名之曰「截取」。欲行是術。必先得一列。曰「列」。二數。曰「起」。曰「止」。乃行是術曰。\n\t吾有一列。名之曰「新列」。\n\t吾有一數。曰「起」。名之曰「針」。\n\t恆為是。若「針」大於「止」者乃止也。\n\t\t夫「列」之「針」。充「新列」以其。\n\t\t加「針」以一。昔之「針」者。今其是也。\n\t乃得「新列」矣。\n是謂「截取」之術也。\n\n吾有一術。名之曰「入棧」。欲行是術。必先得一列。曰「棧」。一元。曰「元」。乃行是術曰。\n\t吾有一列。曰「棧」。名之曰「新棧」。\n\t施「鏡步元」於「元」。名之曰「新元」。\n\t充「新棧」以「新元」。\n\t乃得「新棧」矣。\n是謂「入棧」之術也。\n\n吾有一術。名之曰「首元」。欲行是術。必先得一列。曰「棧」。乃行是術曰。\n\t夫「棧」之長。名之曰「尾」。\n\t夫「棧」之「尾」。名之曰「出元」。\n\t乃得「出元」矣。\n是謂「首元」之術也。\n\n吾有一術。名之曰「出棧」。欲行是術。必先得一列。曰「棧」。乃行是術曰。\n\t夫「棧」之長。名之曰「尾」。\n\t減「尾」以一。昔之「尾」者。今其是矣。\n\t施「截取」於「棧」。於一。於「尾」。乃得其矣。\n是謂「出棧」之術也。\n\n吾有一術。名之曰「書步」。\n欲行是術。必先得一數。曰「步數」。一列。曰「步」。乃行是術曰。\n\t夫「步」之一者。名之曰「步起」。\n\t夫「步」之二者。名之曰「步訖」。\n\t吾有七言。曰「「步」」。曰「步數」。曰「「。自」」。曰「步起」。\n\t\t曰「「移至」」。曰「步訖」。曰「「。」」。書之。\n是謂「書步」之術也。\n\n吾有一術。名之曰「畫步」。是術曰。\n\t夫「三柱」之「「柱名」」者。名之曰「柱名」。\n\t夫「三柱」之「「起」」者。名之曰「盤」。\n\t減「盤數」以「盤」。名之曰「柱」。\n\t夫「柱名」之一。名之曰「起柱名」。\n\t銜「「【」」以「起柱名」。以「「】」」。名之曰「行」。\n\t為是「盤」遍。加「行」以「「〇」」。昔之「行」者。今其是矣。云云。\n\t為是「柱」遍。加「行」以「「一」」。昔之「行」者。今其是矣。云云。\n\t夫「行」者。書之。\n\t夫「三柱」之「「過」」者。名之曰「盤」。\n\t減「盤數」以「盤」。名之曰「柱」。\n\t夫「柱名」之二。名之曰「過柱名」。\n\t銜「「【」」以「過柱名」。以「「】」」。名之曰「行」。\n\t為是「盤」遍。加「行」以「「〇」」。昔之「行」者。今其是矣。云云。\n\t為是「柱」遍。加「行」以「「一」」。昔之「行」者。今其是矣。云云。\n\t夫「行」者。書之。\n\t夫「三柱」之「「訖」」者。名之曰「盤」。\n\t減「盤數」以「盤」。名之曰「柱」。\n\t夫「柱名」之三。名之曰「訖柱名」。\n\t銜「「【」」以「訖柱名」。以「「】」」。名之曰「行」。\n\t為是「盤」遍。加「行」以「「〇」」。昔之「行」者。今其是矣。云云。\n\t為是「柱」遍。加「行」以「「一」」。昔之「行」者。今其是矣。云云。\n\t夫「行」者。書之。\n\t書之。\n是謂「畫步」之術也。\n\n有數三。名之曰「盤數」。\n施「漢諾塔」於「盤數」。於「「甲」」。於「「乙」」。於「「丙」」。\n");

/***/ }),
/* 18 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一數。曰三。名之曰「甲」。\n為是「甲」遍。\n\t吾有一言。曰「「問天地好在。」」。書之。\n云云。");

/***/ }),
/* 19 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一言。曰「「問天地好在。」」。書之。");

/***/ }),
/* 20 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「算經」」之書。方悟「正弦」「餘弦」「圓周率」「取底」「取整」「取頂」「正負」「絕對」之義。\n吾嘗觀「「曆法」」之書。方悟「言今之日時」之義。\n吾嘗觀「「易經」」之書。方悟「占」之義。\n吾嘗觀「「helloworld」」之書。\n\n施「言今之日時」。書之。\n\n施「餘弦」於「圓周率」。書之。\n\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n施「占」。書之。\n\n施「取底」於「圓周率」。書之。\n施「取整」於「圓周率」。書之。\n施「取頂」於「圓周率」。書之。\n施「絕對」於「圓周率」。書之。\n施「正負」於「圓周率」。書之。\n");

/***/ }),
/* 21 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一言。曰「「繞口令  玲瓏塔」」。書之。\n\n吾有一術。名之曰「數玲瓏塔」。\n欲行是術。必先得一數。曰「層」。乃行是術曰。\n\n\t若「層」等於三者。\n    \t吾有一言。曰「「玲瓏塔。塔玲瓏。接過了二層數 三 層。」」。書之。\n    若非。若「層」等於一十三者。\n    \t吾有一言。曰「「玲瓏塔。塔玲瓏。到了尖兒的 一十三 層。」」。書之。\n    若非。\n\t\t吾有三言。曰「「玲瓏塔。塔玲瓏。玲瓏寶塔第」」。曰「層」。曰「「層。」」。書之。\n    云云。云云。\n\t\n\t乘「層」以四。名之曰「四倍之」。\n    \n    若「層」等於二者。\n    \t吾有三言。曰「「兩 张高桌」」。曰「四倍之」。曰「「條腿。兩 個和尚 兩 本經。」」。書之。\n        \n        吾有一言。曰「「兩 副铙钹 兩 口磬。兩 個木了魚子 兩 盞燈。」」。書之。\n        \n        吾有四言。曰「「兩 個金玲整」」。曰「四倍之」。曰「「兩。風兒一刮響嘩楞。」」。書之乃得矣。\n    若非。\n    \t吾有八言。曰「層」。曰「「张高桌」」。曰「四倍之」。曰「「條腿。」」。\n    \t\t曰「層」。曰「「個和尚」」。曰「層」。曰「「本經。」」。書之。\n\t\n\t\t吾有八言。曰「層」。曰「「副铙钹」」。曰「層」。曰「「口磬。」」。\n    \t\t曰「層」。曰「「個木了魚子」」。曰「層」。曰「「盞燈。」」。書之。\n    云云。\n\t\n\t若「四倍之」不大於九者。\n    \t吾有四言。曰「層」。曰「「個金玲整」」。曰「四倍之」。曰「「兩。風兒一刮響嘩楞。」」。書之乃得矣。\n    若非。\n    \t吾有四言。曰「層」。曰「「個金玲」」。曰「四倍之」。曰「「兩。風兒一刮響嘩楞。」」。書之乃得矣。\n    云云。\n\n是謂「數玲瓏塔」之術也。\n\n有數一十又三。名之曰「最高層」。\n\n有數一。名之曰「層」。\n\n恆為是。若「層」大於「最高層」者乃止也。\n\n\t施「數玲瓏塔」於「層」。\n    \t\n加「層」以二。昔之「層」者。今其是矣云云。\n\n吾有一言。曰「「玲瓏寶塔往回數。」」。書之。\n\n減「層」以三。昔之「層」者。今其是矣。\n\n恆為是。若「層」小於二者乃止也。\n\n\t施「數玲瓏塔」於「層」。\n    \n減「層」以二。昔之「層」者。今其是矣云云。\n");

/***/ }),
/* 22 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("或云「「書「甲」焉」」。\n蓋謂「「吾有一言。曰「甲」。書之」」。\n\n書「「問天地好在」」焉。\n\n注曰「「書「「問天地好在」」焉。」」\n疏曰「「凡居「「」」與『』中之宏。不予展開」」\n\n吾嘗觀「「列經」」之書。方悟「遍施」「篩剔」「左併」之義。\n\n\n吾有一術。名之曰「加一」。欲行是術。必先得一數曰「甲」。是術曰。\n\t加一於「甲」。乃得矣。\n是謂「加一」之術也。\n\n吾有一術。名之曰「比三」。欲行是術。必先得一數曰「甲」。是術曰。\n\t若「甲」大於三者乃得陽。若非乃得陰也。\n是謂「比三」之術也。\n\n吾有一術。名之曰「相加」。欲行是術。必先得二數曰「甲」曰「乙」。是術曰。\n\t加「甲」以「乙」。乃得矣。\n是謂「相加」之術也。\n\n\n吾有一列。名之曰「某列」。充「某列」以一以二以三以四以五以六。\n\n\n施「遍施」於「加一」於「某列」。書之。\n\n凡「某列」皆「加一」其上者。書之。\n\n\n施「篩剔」於「比三」於「某列」。書之。\n\n唯「某列」中得「比三」者。書之。\n\n\n施「左併」於「相加」於零於「某列」。書之。\n\n併「某列」於零以「相加」者。書之。\n\n\n施「左併」於「相加」於零。名之曰「求和」。\n\n施「求和」於「某列」。書之。");

/***/ }),
/* 23 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「曼德博」。欲行是術。必先得二數。曰「寬」。曰「高」。乃行是術曰。\n\t批曰。「「曼德博集。亦稱曼德布洛特复数集合。复平面上组成分形之点之集合也。」」\n\n\t吾有一言。曰「「丁龘蠹臺龜畫龍淼蔑高五三二」」。名之曰「皴法」。\n\t批曰。「「皴法者。圖畫之法也」」。\n\n\t減零以一。名之曰「上」。加零以一。名之曰「下」。\n\t減零以二。名之曰「左」。加零以二。名之曰「右」。\n\n\t減「右」以「左」。除其以「寬」。名之曰「橫步」。\n\t減「下」以「上」。除其以「高」。名之曰「縱步」。\n\n\t有數零。名之曰「戊」。恆為是。若「戊」等於「高」者乃止也。\n\n\t\t乘「縱步」以「戊」。加其以「上」。以名之曰「虛」。\n\n\t\t吾有一言。名之曰「行」。\n\n\t\t有數零。名之曰「戌」。恆為是。若「戌」等於「寬」者乃止也。\n\n\t\t\t乘「橫步」以「戌」。加其以「左」。名之曰「實」。\n\n\t\t\t有數「虛」。名之曰「虛虛」。\n\t\t\t有數「實」。名之曰「實實」。\n\n\t\t\t批曰。「「凡每一像素。皆算令其收斂之最大疊代數」」。\n\n\t\t\t有數零。名之曰「己」。恆為是。若「己」等於十二者乃止也。\n\n\t\t\t\t乘「實實」以「實實」。乘「虛虛」以「虛虛」。名之曰「甲」。曰「乙」。\n\t\t\t\t加「甲」以「乙」。名之曰「丙」。\n\t\t\t\t若「丙」大於四者乃止也。\n\n\t\t\t\t乘「虛虛」以「實實」。乘其以二。加其以「虛」。昔之「虛虛」者。今其是矣。\n\t\t\t\t減「甲」以「乙」。加其以「實」。昔之「實實」者。今其是矣。\n\n\t\t\t加一以「己」。昔之「己」者。今其是矣云云。\n\n\t\t\t批曰。「「既得疊代數。乃以皴法圖之」」。\n\n\t\t\t減十三以「己」。名之曰「巳」。\n\t\t\t夫「皴法」之「巳」。名之曰「墨」。\n\t\t\t加「行」以「墨」。昔之「行」者。今其是矣。\n\n\t\t加一以「戌」。昔之「戌」者。今其是矣云云。\n\n\t\t吾有一言。曰「行」。書之。\n\t加一以「戊」。昔之「戊」者。今其是矣云云。\n是謂「曼德博」之術也。\n\n批曰。「「畫曼德博集合之法。至是盡矣。乃一試之」」。\n\n施「曼德博」於五十九。於二十四。\n\n");

/***/ }),
/* 24 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「歸併」。欲行是術。必先得二列。曰「甲」。曰「乙」。\n乃行是術曰。\n\t若「甲」之長等於零者。乃得「乙」也。\n\t若「乙」之長等於零者。乃得「甲」也。\n\n\t吾有二數。曰一。曰一。名之曰「甲引」。曰「乙引」。\n\t吾有一列。名之曰「果」。\n\t恆為是。\n\t\t若「甲」之長小於「甲引」者。乃止也。\n\t\t若「乙」之長小於「乙引」者。乃止也。\n\t\t夫「甲」之「甲引」。名之曰「甲一」。\n\t\t夫「乙」之「乙引」。名之曰「乙一」。\n\t\t若「甲一」不大於「乙一」者。\n\t\t\t充「果」以「甲一」。\n\t\t\t加「甲引」以一。名之曰「甲引」。\n\t\t若非。\n\t\t\t充「果」以「乙一」。\n\t\t\t加「乙引」以一。名之曰「乙引」。\n\t\t也。\n\t云云。\n\n\t若「甲」之長小於「甲引」者。\n\t\t恆為是。\n\t\t\t若「乙」之長小於「乙引」者。乃止也。\n\t\t\t夫「乙」之「乙引」。名之曰「乙餘」。\n\t\t\t充「果」以「乙餘」。\n\t\t\t加「乙引」以一。名之曰「乙引」。\n\t\t云云。\n\t\t乃得「果」\n\t也。\n\t若「乙」之長小於「乙引」者。\n\t\t恆為是。\n\t\t\t若「甲」之長小於「甲引」者。乃止也。\n\t\t\t夫「甲」之「甲引」。名之曰「甲餘」。\n\t\t\t充「果」以「甲餘」。\n\t\t\t加「甲引」以一。名之曰「甲引」。\n\t\t云云。\n\t\t乃得「果」\n\t也。\n是謂「歸併」之術也。\n\n吾有一術。名之曰「並排」。欲行是術。必先得一列。曰「甲」。\n乃行是術曰。\n\t若「甲」之長不大於一者。乃得「甲」也。\n\t夫「甲」之長。名之曰「甲長」。\n\t除「甲長」以二。所餘幾何。名之曰「甲餘」。\n\t減「甲長」以「甲餘」。除其以二。名之曰「甲中」。\n\t吾有二列。名之曰「甲前」。曰「甲後」。\n\t吾有一數。曰一。名之曰「甲引」。\n\t恆為是。\n\t\t若「甲引」大於「甲」之長者。乃止也。\n\t\t夫「甲」之「甲引」。名之曰「甲一」。\n\t\t若「甲引」不大於「甲中」者。\n\t\t\t充「甲前」以「甲一」。\n\t\t若非。\n\t\t\t充「甲後」以「甲一」。\n\t\t也。\n\t\t加「甲引」以一。名之曰「甲引」。\n\t云云。\n\t施「並排」於「甲前」。昔之「甲前」者。今其是矣。\n\t施「並排」於「甲後」。昔之「甲後」者。今其是矣。\n\t施「歸併」於「甲前」。於「甲後」。名之曰「果」。\n\t乃得「果」。\n是謂「並排」之術也。\n\n吾有一列。名之曰「測排」。充「測排」以一。以三。以二。以十八。以十四。\n施「並排」於「測排」。書之。\n");

/***/ }),
/* 25 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一言。曰「「問天地好在。」」。書之。\n有數三十。名之曰「甲」。\n吾有三言。曰「「甲之數」」。曰「甲」。曰「「也」」。書之。\n\n批曰。「「文氣淋灕。字句切實」」。\n\n吾有二爻。曰陽。曰陰。名之曰「天」。曰「地」。\n夫「天」「地」中無陰乎。夫「天」「地」中有陽乎。噫。\n變「天」。名之曰「人」。\n\n減「甲」以一。加「甲」以二。名之曰「乙」。曰「丙」。\n\n吾有一列。名之曰「丁」。\n充「丁」以一。以二。以三。以四。\n\n有數一。名之曰「戊」。\n恆為是。\n\t若「戊」等於「甲」者。\n\t\t乃止\n\t也。\n\t吾有一言。曰「戊」。書之。\n\t加一以「戊」。昔之「戊」者。今其是矣。\n云云。\n\n吾有一術。名之曰「階乘」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t若「甲」等於一者。\n\t\t乃得「甲」。\n\t若非。\n\t\t減「甲」以一。名之曰「乙」。\n\t\t施「階乘」於「乙」。名之曰「丙」。\n\t\t乘「丙」以「甲」。名之曰「丁」。\n\t\t乃得「丁」\n\t也。\n是謂「階乘」之術也。\n\n吾有一術。名之曰「異或」。欲行是術。必先得二爻。曰「甲」。曰「乙」。乃行是術曰。\n\t若「甲」等於「乙」者。\n\t\t乃得陰。\n\t若非。\n\t\t乃得陽\n\t也。\n是謂「異或」之術也。\n\n吾有一術。名之曰「快排」。欲行是術。必先得一列。曰「甲」。乃行是術曰。\n\t若「甲」之長不大於一者。\n\t\t乃得「甲」\n\t也。\n\t吾有三列。名之曰「首」。曰「頷」。曰「尾」。\n\n\t夫「甲」之一。名之曰「甲一」。\n\t充「頷」以「甲一」。\n\t夫「甲」之其餘。名之曰「甲餘」。\n\n\t凡「甲餘」中之「丁」。\n\t\t若「丁」小於「甲一」者。\n\t\t\t充「首」以「丁」。\n\t\t若非。\n\t\t\t充「尾」以「丁」\n\t\t也。\n\t云云。\n\t施「快排」於「首」。昔之「首」者。今其是矣。\n\t施「快排」於「尾」。昔之「尾」者。今其是矣。\n\n\t銜「首」以「頷」以「尾」。名之曰「乙」。\n\t乃得「乙」。\n\n是謂「快排」之術也。\n\n吾有一列。名之曰「己」。\n充「己」以五。以三。以二十。以八。以三十五。以七百。\n施「快排」於「己」。書之。\n");

/***/ }),
/* 26 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「大衍求一」。欲行是術。必先得二數。曰「奇」。曰「定」。乃行是術曰。\n注曰「「\n\t大衍求一術云。\n\t置奇右上。定居右下。立天元一於左上。\n\t先以右上除右下。所得商數與左上一相生。入左下。然後乃以右行上下。\n\t以少除多。遞互除之。所得商數隨即遞互累乘。歸左行上下。\n\t須使右上末後奇一而止。乃驗左上所得。以為乘率。\n\t或奇數已見單一者。便為乘率。\n」」\n\t若「奇」等於〇者。乃得〇也。\n\t若「奇」等於一者。乃得一也。\n\n\t有數一。名之曰「天元」。\n\t吾有四數。曰「奇」曰「定」曰「天元」曰〇。\n\t\t名之曰「右上」曰「右下」曰「左上」曰「左下」。\n\n\t恆為是。\n\t\t若「右上」等於一者。乃得「左上」也。\n\n\t\t除「右下」以「右上」。所餘幾何。名之曰「餘數」。\n\t\t減「右下」以「餘數」。除其以「右上」。名之曰「商數」。\n\t\t乘「商數」以「左上」。加「左下」以其。昔之「左下」者。今其是矣。\n\t\t昔之「右下」者。今「餘數」是矣。\n\n\t\t若「右下」等於〇者。乃得〇也。\n\t\t注曰。「「若右下等於〇者。曰奇數與定數不互素。無乘率也。」」\n\n\t\t減「右上」以一，除其以「右下」。所餘幾何。加其以一。名之曰「餘數」。\n\t\t減「右上」以「餘數」。除其以「右下」。名之曰「商數」。\n\t\t乘「商數」以「左下」。加「左上」以其。昔之「左上」者。今其是矣。\n\t\t昔之「右上」者。今「餘數」是矣。\n\t云云。\n是謂「大衍求一」之術也。\n\n\n施「大衍求一」於四十九。於十四萬二千八百五十七。名之曰「乘率」。\n乘四十九以「乘率」。除其以十四萬二千八百五十七。所餘幾何。書之。\n");

/***/ }),
/* 27 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術名之曰「乘算口訣」。是術曰。\n\t有數一名之曰「甲」。\n\t恆為是。若「甲」不小於十者乃止也。\n\t\t有數一名之曰「乙」。\n\t\t加「甲」以「乙」名之曰「丙」。\n\t\t恆為是。若「乙」不小於「丙」者乃止也。\n\t\t\t\t乘「甲」以「乙」名之曰「果」。\n\t\t\t\t若「果」不小於十者吾有三言。曰「乙」曰「甲」曰「果」書之。\n\t\t\t\t若非吾有四言。曰「乙」曰「甲」曰「「得」」曰「果」書之也。\n\t\t\t\t加「乙」以一。昔之「乙」者今其是矣。\n\t\t云云。\n\t\t加「甲」以一。昔之「甲」者今其是矣。\n\t云云。\n是謂「乘算口訣」之術也。\n施「乘算口訣」。\n");

/***/ }),
/* 28 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("有數三。名之曰「甲」。\n有數四。名之曰「乙」。\n有數五。名之曰「丙」。\n吾有一列。名之曰「癸」。充「癸」以一以二以三。\n\n吾有一術。名之曰「丁」。欲行是術。必先得三數。曰「寅」曰「卯」曰「辰」乃行是術曰。\n\t乃得一。\n是謂「丁」之術也。\n\n吾有一術。名之曰「戊」。欲行是術。必先得二數。曰「寅」曰「卯」乃行是術曰。\n\t乃得二。\n是謂「戊」之術也。\n\n吾有一術。名之曰「己」。欲行是術。必先得一數。曰「寅」乃行是術曰。\n\t乃得三。\n是謂「己」之術也。\n\n注曰「「庚 = 戊(甲,乙)」」\n夫「甲」。夫「乙」。取二以施「戊」。名之曰「庚」。\n\n注曰「「子 = 戊(甲+乙,丙)」」\n加「甲」以「乙」。夫「丙」。取二以施「戊」。名之曰「子」。\n\n注曰「「丑 = 戊(癸[3],癸.length)」」\n夫「癸」之三。夫「癸」之長。取二以施「戊」。名之曰「丑」。\n\n注曰「「辛 = 戊(甲,戊(乙,丙))」」\n夫「甲」。夫「乙」。夫「丙」。取二以施「戊」。取二以施「戊」。名之曰「辛」。\n\n注曰「「壬 = 丁(己(戊(甲,戊(乙,丙))),甲,乙)」」\n夫「甲」。夫「乙」。夫「丙」。取二以施「戊」。取二以施「戊」。取一以施「己」。夫「甲」。夫「乙」。取三以施「丁」。名之曰「壬」。");

/***/ }),
/* 29 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一物。名之曰「精衛」。其物如是。\n\t物之「「名」」者。言曰「「女娃」」。\n\t物之「「足數」」者。數曰二。\n\t物之「「喙數」」者。數曰一。\n是謂「精衛」之物也。\n\n吾有一術。名之曰「造物之術」。欲行是術。必先得一言。曰「甲」。乃行是術曰。\n\t吾有一物。名之曰「乙」。其物如是。\n\t\t物之「「丙」」者。言曰「甲」。\n\t\t物之「「丁」」者。數曰四。\n\t是謂「乙」之物也。\n\t乃得「乙」。\n是謂「造物之術」之術也。\n\n施「造物之術」於「「某甲」」。名之曰「戊」。\n昔之「戊」之「「丁」」者。今五是矣。\n施「JSON.stringify」於「戊」。書之。\n昔之「戊」之「「丁」」者。今不復存矣。\n施「JSON.stringify」於「戊」。書之。");

/***/ }),
/* 30 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「賈憲三角」。欲行是術。必先得一數。曰「層數」。乃行是術曰。\n\t吾有一列。名之曰「前層之得」。\n\t充「前層之得」以一。夫「前層之得」。書之。\n\t若「層數」等於一者乃歸空無也。\n\n\t充「前層之得」以一。夫「前層之得」。書之。\n\t若「層數」等於二者乃歸空無也。\n\n\t有數三。名之曰「計甲」。\n\t恆為是。若「計甲」大於「層數」者乃止也。\n\t\t吾有一列。名之曰「此層之得」。\n\t\t充「此層之得」以一。\n\t\t有數一。名之曰「計乙」。\n\t\t夫「前層之得」之長。名之曰「層長」。\n\t\t恆為是。若「計乙」不小於「層長」者乃止也\n\t\t\t加一以「計乙」。名之曰「計乙又一」\n\t\t\t夫「前層之得」之「計乙」。名之曰「數甲」。\n\t\t\t夫「前層之得」之「計乙又一」。名之曰「數乙」。\n\t\t\t加「數甲」以「數乙」。名之曰「新數」。\n\t\t\t充「此層之得」以「新數」。\n\t\t\t加「計乙」以一。昔之「計乙」者。今其是矣。\n\t\t云云。\n\t\t充「此層之得」以一。夫「此層之得」。書之。\n\t\t昔之「前層之得」者。今「此層之得」是矣。\n\t\t加「計甲」以一。昔之「計甲」者。今其是矣。\n\t云云\n是謂「賈憲三角」之術也。\n\n施「賈憲三角」於九。\n");

/***/ }),
/* 31 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「萊布尼茲圓周率估算」。\n欲行是術。必先得一數。\n曰「頂」。\n乃行是術曰。\n\t吾有三數。名之曰「埃」曰「積」曰「畸」。\n\t有數一。名之曰「符」。\n\t恆為是。\n\t\t若「埃」大於「頂」者，乃止也。\n\t\t乘二於「埃」，名之曰「畸」。\n\t加一於「畸」，名之曰「畸」。\n\t除「符」以「畸」，名之曰「畸」。\n\t乘四於「畸」，名之曰「畸」。\n\t\t加「畸」於「積」，名之曰「積」。\n\t\t乘負一於「符」，名之曰「符」。\n\t\t加一於「埃」，名之曰「埃」。\n\t云云。\n\t乃得「積」。\n是謂「萊布尼茲圓周率估算」之術也。\n\n施「萊布尼茲圓周率估算」於十。書之。\n施「萊布尼茲圓周率估算」於六十九。書之。\n施「萊布尼茲圓周率估算」於四百二十。書之。\n施「萊布尼茲圓周率估算」於一千三百三十七。書之。\n施「萊布尼茲圓周率估算」於十一萬四千五百一十四。書之。");

/***/ }),
/* 32 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("注曰「「割圓術始載於劉徽所著九章算術注」」\n\n吾嘗觀「「算經」」之書。方悟「冪」「平方根」之義。\n\n吾有一數。曰一。名之曰「半徑」。\n乘「半徑」以「半徑」。名之曰「半徑平方」。\n\n吾有一術。名之曰「求小弦」。欲行是術。必先得二數。曰「裏觚之面」。曰「輪數」。乃行是術曰。\n\t若「輪數」小於一者。乃得「裏觚之面」也。\n\t除「裏觚之面」以二。名之曰「半面」。\n\t乘「半面」以「半面」。名之曰「半面平方」。\n\t減「半徑平方」以「半面平方」。取一以施「平方根」。名之曰「股」。\n\t減「半徑」以「股」。名之曰「小句」。\n\t乘「小句」以「小句」。加其以「半面平方」。取一以施「平方根」。名之曰「小弦」。\n\t夫「小弦」。減「輪數」以一。取二以施「求小弦」。乃得矣。\n是謂「求小弦」之術也。\n\n注曰「「輪數始於一」」\n吾有一術。名之曰「割圓術求圓率」。欲行是術。必先得一數曰「輪數」。乃行是術曰。\n\t減「輪數」以一。昔之「輪數」者。今其是矣。\n\t施「冪」於二於「輪數」。乘其以六。名之曰「觚數」。\n\t施「求小弦」於「半徑」於「輪數」。名之曰「小弦」。\n\t乘「小弦」以「觚數」。名之曰「觚周」。\n\t除「觚周」以二。乘其以「半徑」。名之曰「觚冪」。\n\t除「觚冪」以「半徑平方」。名之曰「圓率」。\n\t夫「「割圓」」。夫「觚數」。夫「「觚。所得圓率者。」」。書之。\n\t夫「圓率」。夫「「也。」」。書之。\n\t乃得「圓率」。\n是謂「割圓術求圓率」之術也。\n\n施「割圓術求圓率」於十。\n");

/***/ }),
/* 33 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「快排」。欲行是術。必先得一列。曰「甲」。乃行是術曰。\n\t若「甲」之長不大於一者。\n\t\t乃得「甲」\n\t也。\n\t吾有三列。名之曰「首」。曰「頷」。曰「尾」。\n\n\t夫「甲」之一。名之曰「甲一」。\n\t充「頷」以「甲一」。\n\t夫「甲」之其餘。名之曰「甲餘」。\n\n\t凡「甲餘」中之「丁」。\n\t\t若「丁」小於「甲一」者。\n\t\t\t充「首」以「丁」。\n\t\t若非。\n\t\t\t充「尾」以「丁」\n\t\t也。\n\t云云。\n\t施「快排」於「首」。昔之「首」者。今其是矣。\n\t施「快排」於「尾」。昔之「尾」者。今其是矣。\n\n\t銜「首」以「頷」以「尾」。名之曰「乙」。\n\t乃得「乙」。\n\n是謂「快排」之術也。\n\n吾有一列。名之曰「己」。\n充「己」以五。以三。以二十。以八。以三十五。以七百。\n施「快排」於「己」。書之。");

/***/ }),
/* 34 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「降龍十八掌」。欲行是術。必先得二數。曰「少陽」。曰「老陽」。一列。曰「陰」。\n是術曰。\n\t若「少陽」不小於「老陽」者。\n\t\t乃得陰。\n\t也。\n\t吾有一數。名之曰「太極」。\n\t施「一陽指」於「少陽」。於「老陽」。於「陰」。昔之「太極」者。今其是矣。\n\t減一於「太極」。名之曰「少陰」。\n\t加一以「太極」。名之曰「老陰」。\n\t施「降龍十八掌」於「少陽」。於「少陰」。於「陰」。\n\t施「降龍十八掌」於「老陰」。於「老陽」。於「陰」。\n\t乃得陽。\n是謂「降龍十八掌」之術也。\n\n\n吾有一術。名之曰「一陽指」。欲行是術。必先得二數。曰「少陽」。曰「老陽」。一列。曰「陰」。\n是術曰。\n\t吾有一數。曰「少陽」。名之曰「乾」。\n\t吾有一數。曰「少陽」。名之曰「坤」。\n\t恆為是。若「乾」不小於「老陽」者乃止也。\n\t\t若「陰」之「乾」小於「陰」之「老陽」者。\n\t\t\t施「乾坤大挪移」於「坤」。於「乾」。於「陰」。\n\t\t\t加一以「坤」。昔之「坤」者。今其是矣。\n\t\t也。\n\t\t加一以「乾」。昔之「乾」者。今其是矣。\n\t云云。\n\n\t批曰。「「若再施乾坤大挪移。则走火入魔。何故。是行便宜之法以达同之功。」」。\n\t\t夫「陰」之「老陽」。名之曰「陰乾」。\n\t夫「陰」之「坤」。名之曰「陰坤」。\n\t昔之「陰」之「乾」者。今「陰坤」是矣。\n\t昔之「陰」之「坤」者。今「陰乾」是矣。\n\t乃得「坤」。\n是謂「一陽指」之術也。\n\n\n吾有一術。名之曰「乾坤大挪移」。欲行是術。必先得二數。曰「乾」。曰「坤」。一列。曰「陰」。\n是術曰。\n\t夫「陰」之「乾」。名之曰「陰乾」。\n\t夫「陰」之「坤」。名之曰「陰坤」。\n\t昔之「陰」之「乾」者。今「陰坤」是矣。\n\t昔之「陰」之「坤」者。今「陰乾」是矣。\n是謂「乾坤大挪移」之術也。\n\n\n有數一。名之曰「少陽」。\n吾有一列。名之曰「陰」。充「陰」以四。以二。以五。以三。以一。\n夫「陰」之長。名之曰「老陽」。\n施「降龍十八掌」於「少陽」。於「老陽」。於「陰」。\n吾有一列。曰「陰」。名之曰「陽」。\n吾有一言。曰「陽」。書之。\n");

/***/ }),
/* 35 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("注曰Reference: 注曰https://qiita.com/amoO_O/items/5d0c4edfc99f64bea6fb\n吾有一術。名之曰「自己複製」。欲行是術。是術曰。吾有一術。名之曰「置換」。欲行是術。必先得三數。曰「文字列」。曰「置換対象」。曰「置換先」是術曰。吾有一言。曰「「」」。名之曰「返品」。吾有一數。曰二。名之曰「未来」。吾有一爻。曰陽。名之曰「実行条件」。凡「文字列」中之「文字」。若「実行条件」者。若「文字」等於「「星」」中無陰乎「文字列」之「未来」等於「置換対象」者。昔之「文字」者。今「置換先」是。昔之「実行条件」者。今陰是。也。加「返品」以「文字」。昔之「返品」者。今其是矣。若非。昔之「実行条件」者。今陽是。也。加「未来」以一。昔之「未来」者。今其是矣。云云。乃得「返品」。是謂「置換」之術也。吾有一言。曰String.fromCharCode名之曰「函数」。施「函数」於一萬二千三百。昔之「始」者。今其是矣。施「函数」於一萬二千三百零一。昔之「終」者。今其是矣。吾有二言。曰「「吾有一術。名之曰星甲自己複製星乙。欲行是術。是術曰。吾有一術。名之曰星甲置換星乙。欲行是術。必先得三數。曰星甲文字列星乙。曰星甲置換対象星乙。曰星甲置換先星乙是術曰。吾有一言。曰星甲星甲星乙星乙。名之曰星甲返品星乙。吾有一數。曰二。名之曰星甲未来星乙。吾有一爻。曰陽。名之曰星甲実行条件星乙。凡星甲文字列星乙中之星甲文字星乙。若星甲実行条件星乙者。若星甲文字星乙等於星甲星甲星星乙星乙中無陰乎星甲文字列星乙之星甲未来星乙等於星甲置換対象星乙者。昔之星甲文字星乙者。今星甲置換先星乙是。昔之星甲実行条件星乙者。今陰是。也。加星甲返品星乙以星甲文字星乙。昔之星甲返品星乙者。今其是矣。若非。昔之星甲実行条件星乙者。今陽是。也。加星甲未来星乙以一。昔之星甲未来星乙者。今其是矣。云云。乃得星甲返品星乙。是謂星甲置換星乙之術也。吾有一言。曰String.fromCharCode名之曰星甲函数星乙。施星甲函数星乙於一萬二千三百。昔之星甲始星乙者。今其是矣。施星甲函数星乙於一萬二千三百零一。昔之星甲終星乙者。今其是矣。吾有二言。曰星甲星甲星丙星乙星乙。曰星甲星甲星乙星乙。名之曰星甲原文星乙曰星甲結果星乙。施星甲置換星乙於星甲原文星乙。於星甲星甲甲星乙星乙。於星甲始星乙。昔之星甲結果星乙者。今其是矣。施星甲置換星乙於星甲結果星乙。於星甲星甲乙星乙星乙。於星甲終星乙。昔之星甲結果星乙者。今其是矣。施星甲置換星乙於星甲結果星乙。於星甲星甲丙星乙星乙。於星甲原文星乙。昔之星甲結果星乙者。今其是矣。吾有一言。曰星甲結果星乙。書之。是謂星甲自己複製星乙之術也。施星甲自己複製星乙。」」。曰「「」」。名之曰「原文」曰「結果」。施「置換」於「原文」。於「「甲」」。於「始」。昔之「結果」者。今其是矣。施「置換」於「結果」。於「「乙」」。於「終」。昔之「結果」者。今其是矣。施「置換」於「結果」。於「「丙」」。於「原文」。昔之「結果」者。今其是矣。吾有一言。曰「結果」。書之。是謂「自己複製」之術也。施「自己複製」。");

/***/ }),
/* 36 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("注曰Reference: 注曰https://qiita.com/amoO_O/items/5d0c4edfc99f64bea6fb\n吾有一術。名之曰「自己複製」。\n欲行是術。是術曰。\n\n吾有一術。名之曰「置換」。\n欲行是術。必先得三數。\n曰「文字列」。曰「置換対象」。曰「置換先」是術曰。\n\t吾有一言。曰「「」」。名之曰「返品」。\n\t吾有一數。曰二。名之曰「未来」。\n\t吾有一數。曰陽。名之曰「実行条件」。\n\t凡「文字列」中之「文字」。\n\t\t若「実行条件」者。\n\t\t\t若「文字」等於「「星」」」中無陰乎「文字列」之「未来」等於「置換対象」者。\n\t\t\t\t加「返品」以「置換先」。昔之「返品」者。今其是矣。\n\t\t\t\t昔之「実行条件」者。今陰是。\n\t\t\t若非。\n\t\t\t\t加「返品」以「文字」。昔之「返品」者。今其是矣。\n\t\t\t也。\n\t\t若非。\n\t\t\t昔之「実行条件」者。今陽是。\n\t\t也。\n\t\t加「未来」以一。昔之「未来」者。今其是矣。\n\t云云。\n\t乃得「返品」。\n是謂「置換」之術也。\n\n吾有一言。曰String.fromCharCode名之曰「函数」。\n施「函数」於一萬二千三百。昔之「始括弧」者。今其是矣。\n施「函数」於一萬二千三百零一。昔之「終括弧」者。今其是矣。\n施「函数」於三十二。昔之「空白」者。今其是矣。\n加「空白」以「空白」。昔之「空白」者。今其是矣。\n施「函数」於十。昔之「改行」者。今其是矣。\n吾有一言。曰「「吾有一術。名之曰星甲自己複製星乙。星丁欲行是術。是術曰。星丁星丁吾有一術。名之曰星甲置換星乙。星丁欲行是術。必先得三數。星丁曰星甲文字列星乙。曰星甲置換対象星乙。曰星甲置換先星乙是術曰。星丁星丙吾有一言。曰星甲星甲星乙星乙。名之曰星甲返品星乙。星丁星丙吾有一數。曰二。名之曰星甲未来星乙。星丁星丙吾有一數。曰陽。名之曰星甲実行条件星乙。星丁星丙凡星甲文字列星乙中之星甲文字星乙。星丁星丙星丙星丙若星甲実行条件星乙者。星丁星丙星丙星丙星丙若星甲文字星乙等於星甲星甲星星乙星乙星乙中無陰乎星甲文字列星乙之未来等於星甲置換対象星乙者。星丁星丙星丙星丙星丙星丙加星甲返品星乙以星甲置換先星乙。昔之星甲返品星乙者。今其是矣。星丁星丙星丙星丙星丙星丙昔之星甲実行条件星乙者。今陰是。星丁星丙星丙星丙星丙若非。星丁星丙星丙星丙星丙星丙加星甲返品星乙以星甲文字星乙。昔之星甲返品星乙者。今其是矣。星丁星丙星丙星丙星丙也。星丁星丙星丙星丙若非。星丁星丙星丙星丙星丙昔之星甲実行条件星乙者。今陽是。星丁星丙星丙星丙也。星丁星丙星丙加星甲未来星乙以一。昔之星甲未来星乙者。今其是矣。星丁星丙云云。星丁星丙乃得星甲返品星乙。星丁是謂星甲置換星乙之術也。星丁星丁吾有一言。曰String.fromCharCode名之曰星甲函数星乙。星丁施星甲函数星乙於一萬二千三百。昔之星甲始括弧星乙者。今其是矣。星丁施星甲函数星乙於一萬二千三百零一。昔之星甲終括弧星乙者。今其是矣。星丁施星甲函数星乙於三十二。昔之星甲空白星乙者。今其是矣。星丁加星甲空白星乙以星甲空白星乙。昔之星甲空白星乙者。今其是矣。星丁施星甲函数星乙於十。昔之星甲改行星乙者。今其是矣。星丁吾有一言。曰星甲星甲星戊星乙星乙。名之曰星甲原文星乙。星丁吾有一言。曰星甲星甲星乙星乙。名之曰星甲結果星乙。星丁施星甲置換星乙於星甲原文星乙。於星甲星甲甲星乙星乙。於星甲始括弧星乙。昔之星甲結果星乙者。今其是矣。星丁施星甲置換星乙於星甲結果星乙。於星甲星甲乙星乙星乙。於星甲終括弧星乙。昔之星甲結果星乙者。今其是矣。星丁施星甲置換星乙於星甲結果星乙。於星甲星甲丙星乙星乙。於星甲空白星乙。昔之星甲結果星乙者。今其是矣。星丁施星甲置換星乙於星甲結果星乙。於星甲星甲丁星乙星乙。於星甲改行星乙。昔之星甲結果星乙者。今其是矣。星丁施星甲置換星乙於星甲結果星乙。於星甲星甲戊星乙星乙。於星甲原文星乙。昔之星甲結果星乙者。今其是矣。星丁吾有一言。曰星甲結果星乙。書之。星丁星丁是謂星甲自己複製星乙之術也。星丁施星甲自己複製星乙。」」。名之曰「原文」。\n吾有一言。曰「「」」。名之曰「結果」。\n施「置換」於「原文」。於「「甲」」。於「始括弧」。昔之「結果」者。今其是矣。\n施「置換」於「結果」。於「「乙」」。於「終括弧」。昔之「結果」者。今其是矣。\n施「置換」於「結果」。於「「丙」」。於「空白」。昔之「結果」者。今其是矣。\n施「置換」於「結果」。於「「丁」」。於「改行」。昔之「結果」者。今其是矣。\n施「置換」於「結果」。於「「戊」」。於「原文」。昔之「結果」者。今其是矣。\n吾有一言。曰「結果」。書之。\n\n是謂「自己複製」之術也。\n施「自己複製」。");

/***/ }),
/* 37 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「擇排」。欲行是術。必先得一列。曰「數列」。乃行是術曰。\n\t吾有一列。名之曰「答列」。\n\t夫「數列」之長。名之曰「度」。\n\t為是「度」遍。\n\t\t夫「數列」之一。名之曰「若者」。\n\t\t吾有一數。曰一。名之曰「若者之位」。\n\t\t吾有一數。曰一。名之曰「位」。\n\t\t凡「數列」中之「員」。\n\t\t\t若「員」小於「若者」者。\n\t\t\t\t昔之「若者」者。今「員」是矣。\n\t\t\t\t昔之「若者之位」者。今「位」是矣。\n\t\t\t也。\n\t\t\t加一於「位」。名之曰「位」。\n\n\t\t云云。\n\t\t充「答列」以「若者」。\n\n\t\t吾有一列。名之曰「數列新世」。\n\t\t吾有一數。曰一。名之曰「新位」。\n\t\t凡「數列」中之「員」。\n\t\t\t若「新位」小於「若者之位」者。\n\t\t\t\t充「數列新世」以「員」。\n\t\t\t也。\n\t\t\t若「新位」大於「若者之位」者。\n\t\t\t\t充「數列新世」以「員」。\n\t\t\t也。\n\t\t\t加一於「新位」。名之曰「新位」。\n\n\t\t云云。\n\t\t昔之「數列」者。今「數列新世」是矣。\n\n\t云云。\n\n\t乃得「答列」。\n是謂「擇排」之術也。\n\n\n吾有一列。名之曰「測排」。\n充「測排」以八。以千。以十。以五。以五十五。以三百。以九。\n施「擇排」於「測排」。書之。\n");

/***/ }),
/* 38 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「渾沌經」」之書。方悟「包渾沌」「食渾沌」之義。\n\n吾有一言。曰「「\\\n\t物\\\n\t\t之「名」言「李白」\\\n\t\t之「字」言「太白」\\\n\t\t之「號」言「青蓮」\\\n\t\t之「壽考」數「六一」\\\n\t\t之「生年」言「長安元年」\\\n\t\t之「卒年」言「上元三年」\\\n\t\t之「存詩」數「九〇〇」\\\n\t\t之「擅詩」爻「陽」\\\n\t\t之「官」物\\\n\t\t\t之「銜」言「翰林」。\\\n\t\t\t之「年」言「天寶元年」。\\\n\t\t也\\\n\t\t之「名句」列\\\n\t\t\t物\\\n\t\t\t\t之「題」言「清平調」\\\n\t\t\t\t之「文」言「雲想衣裳花相容。春風拂檻露華濃。」\\\n\t\t\t也\\\n\t\t\t物\\\n\t\t\t\t之「題」言「長相思」\\\n\t\t\t\t之「文」言「長相思。在長安。絡緯秋啼金井闌。微霜淒淒簟色寒。」\\\n\t\t\t也\\\n\t\t\t物\\\n\t\t\t\t之「題」言「襄陽歌」\\\n\t\t\t\t之「文」言「落日欲沒峴山西。倒著接蘺花下迷。襄陽小兒齊拍手。攔街爭唱「白銅鞮」。」\\\n\t\t\t也\\\n\t\t\t物\\\n\t\t\t\t之「題」言「楊叛兒」\\\n\t\t\t\t之「文」言「烏啼隱楊花。君醉留妾家。博山爐中沉香火。雙煙一氣凌紫霞。」\\\n\t\t\t也\\\n\t\t也\\\n\t\t之「子女」列\\\n\t\t\t言「伯禽」言「平陽」言「頗黎」\\\n\t\t也\\\n\t也\\\n」」。名之曰「李翰林」。\n\n\n施「食渾沌」於「李翰林」。名之曰「太白餛飩」。\n施「JSON.stringify」於「太白餛飩」。書之。\n施「包渾沌」於「太白餛飩」。書之。\n");

/***/ }),
/* 39 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「埃氏篩」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n\t吾有一列。名之曰「掩」。為是「甲」遍。充「掩」以陽也。\n\t除「甲」以二。名之曰「甲半」。\n\n\t有數二。名之曰「戊」。恆為是。若「戊」等於「甲半」者乃止也。\n\t\t有數二。名之曰「戌」。恆為是。若「戌」等於「甲半」者乃止也。\n\n\t\t\t乘「戊」以「戌」。名之曰「合」\n\t\t\t若「合」不大於「甲」者。\n\t\t\t\t昔之「掩」之「合」者。今陰是矣。\n\t\t\t若非乃止也。\n\t\t加一以「戌」。昔之「戌」者。今其是矣云云。\n\t加一以「戊」。昔之「戊」者。今其是矣云云。\n\n\t吾有一列。名之曰「諸素」。\n\t昔之「戊」者。今二是矣。恆為是。若「戊」等於「掩」之長者乃止也。\n\t\t夫「掩」之「戊」。名之曰「素耶」。\n\t\t若「素耶」者充「諸素」以「戊」也。\n\t加一以「戊」。昔之「戊」者。今其是矣云云。\n\t乃得「諸素」。\n是謂「埃氏篩」之術也。\n\n施「埃氏篩」於一百。書之。");

/***/ }),
/* 40 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「牛頓求根法」。\n欲行是術。必先得一數。\n曰「試」。\n乃行是術曰。\n\t\t有數一。名之曰「甲」。\n\t有數一。名之曰「乙」。\n\t為是「試」遍。\n\t\t乘「甲」於「甲」，名之曰「乙」。減「乙」以二，名之曰「乙」\n\t\t乘二於「甲」，名之曰「丙」。\n\t\t除「乙」以「丙」，名之曰「茂」。\n\t\t減「甲」以「茂」，名之曰「甲」。\n\t云云。\n\t乃得「甲」。\n是謂「牛頓求根法」之術也。\n\n施「牛頓求根法」於二。書之。\n施「牛頓求根法」於三。書之。\n施「牛頓求根法」於五。書之。\n施「牛頓求根法」於七。書之。\n施「牛頓求根法」於十三。書之。\n施「牛頓求根法」於一百三十一。書之。\n施「牛頓求根法」於一千零一十三。書之。");

/***/ }),
/* 41 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「畫譜」」之書。方悟「備紙」「擇筆」「蘸色」「落筆」「運筆」「提筆」「裱畫」之義。\n吾嘗觀「「算經」」之書。方悟「正弦」「餘弦」「半圓周率」之義。\n\n吾有一術。名之曰「畫樹法」。欲行是術。必先得一物。曰「紙」。\n五數。曰「東」曰「南」曰「長」曰「粗」曰「向」。是術曰。\n\n\t施「餘弦」於「向」。乘其以「長」。加其以「東」。名之曰「末東」\n\t施「正弦」於「向」。乘其以「長」。減其於「南」。名之曰「末南」\n\n\t施「擇筆」於「紙」於「粗」。\n\n\t施「落筆」於「紙」於「東」於「南」。\n\t施「運筆」於「紙」於「末東」於「末南」。\n\t施「提筆」於「紙」。\n\n\t加「向」以零又三分。名之曰「左向」。\n\t減「向」以零又三分。名之曰「右向」。\n\t乘「長」以零又八分。名之曰「枝長」。\n\t乘「粗」以零又八分。名之曰「枝粗」。\n\n\t若「枝長」小於五者。乃歸空無也。\n\n\t施「畫樹法」於「紙」。於「末東」。於「末南」。於「枝長」。於「枝粗」。於「左向」。\n\t施「畫樹法」於「紙」。於「末東」。於「末南」。於「枝長」。於「枝粗」。於「右向」。\n\n是謂「畫樹法」之術也。\n\n\n施「備紙」於二百五十六。於二百五十六。名之曰「紙」。\n施「蘸色」於「紙」於「「黑」」。\n施「畫樹法」於「紙」。於一百二十八。於二百五十六。於五十。於五。於「半圓周率」。\n施「裱畫」於「紙」於「「out」」");

/***/ }),
/* 42 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀「「畫譜」」之書。方悟「備紙」「擇筆」「蘸色」「落筆」「運筆」「提筆」「裱畫」之義。\n吾嘗觀「「算經」」之書。方悟「正弦」「餘弦」「半圓周率」「四分圓周率」之義。\n吾嘗觀「「易經」」之書。方悟「運」「占」之義。\n\n施「運」於十六。\n\n吾有一術。名之曰「畫樹法」。欲行是術。必先得一物。曰「紙」。\n六數。曰「東」曰「南」曰「長」曰「粗」曰「向」曰「向變」。是術曰。\n\n\t施「餘弦」於「向」。乘其以「長」。加其以「東」。名之曰「末東」\n\t施「正弦」於「向」。乘其以「長」。減其於「南」。名之曰「末南」\n\n\t減「末南」以二。名之曰「雪上」。\n\t減「南」以二。名之曰「雪下」。\n\n\t施「擇筆」於「紙」於「粗」。\n\t施「蘸色」於「紙」於「「鈦白」」。\n\t施「落筆」於「紙」於「東」於「雪下」。\n\t施「運筆」於「紙」於「末東」於「雪上」。\n\t施「提筆」於「紙」。\n\n\t施「擇筆」於「紙」於「粗」。\n\t施「蘸色」於「紙」於「「黑」」。\n\t施「落筆」於「紙」於「東」於「南」。\n\t施「運筆」於「紙」於「末東」於「末南」。\n\t施「提筆」於「紙」。\n\n\t加「向」以零又三分。乘其以零又五分。加其以「四分圓周率」。名之曰「左向」。\n\t減「向」以零又三分。乘其以零又五分。加其以「四分圓周率」。名之曰「右向」。\n\t施「占」。減其以零又五分。乘其以「向變」。名之曰「左歪」。\n\t施「占」。減其以零又五分。乘其以「向變」。名之曰「右倒」。\n\t加「左向」以「左歪」。昔之「左向」者。今其是矣。\n\t加「右向」以「右倒」。昔之「右向」者。今其是矣。\n\n\t施「占」。乘其以二。加其以三。除其以五。乘其於「長」。名之曰「左枝長」。\n\t施「占」。乘其以二。加其以三。除其以五。乘其於「長」。名之曰「右枝長」。\n\t乘「粗」以零又八分。名之曰「枝粗」。\n\t乘「向變」以零又九分。名之曰「枝向變」。\n\n\t有爻陰。名之曰「著花」。\n\t若「枝粗」小於一者。\n\t\t施「占」。若其小於零又三分者。昔之「著花」者。今陽是矣。云云。\n\t若非。\n\t\t施「占」。若其小於零又二分者。昔之「著花」者。今陽是矣。云云。\n\t云云。\n\n\t施「占」。若「著花」者\n\t\t減「末南」以二。名之曰「苞」。\n\t\t施「占」。乘其以四。加其以三。名之曰「瓣」\n\t\t施「擇筆」於「紙」於「瓣」。\n\t\t施「蘸色」於「紙」於「「曙紅」」。\n\t\t施「落筆」於「紙」於「末東」於「末南」。\n\t\t施「運筆」於「紙」於「末東」於「苞」。\n\t\t施「提筆」於「紙」。\n\t云云\n\n\t若「枝粗」小於一又二分者。乃歸空無也。\n\n\t施「畫樹法」於「紙」於「末東」於「末南」於「左枝長」於「枝粗」於「左向」於「枝向變」。\n\t施「畫樹法」於「紙」於「末東」於「末南」於「右枝長」於「枝粗」於「右向」於「枝向變」。\n\n是謂「畫樹法」之術也。\n\n\n吾有一術。名之曰「畫地法」。欲行是術。必先得一物。曰「紙」。\n五數。曰「左」曰「右」曰「底」曰「高」曰「步」。是術曰。\n\n\t施「擇筆」於「紙」於「高」。\n\t施「蘸色」於「紙」於「「鈦白」」。\n\t施「落筆」於「紙」於「左」於「底」。\n\n\t有數一。名之曰「戊」。恆為是。若「戊」大於「右」者乃止也。\n\t\t施「占」。乘其以「高」。減其於「底」。名之曰「厚」\n\t\t施「運筆」於「紙」於「戊」於「厚」。\n\t加「戊」以「步」。昔之「戊」者。今其是矣。云云。\n\n\t施「運筆」於「紙」於「右」於「底」。\n\t施「提筆」於「紙」。\n\n\n是謂「畫地法」之術也。\n\n施「備紙」於五百十二。於二百五十六。名之曰「紙」。\n\n施「畫樹法」於「紙」於一百八十於二百五十六於五十於十於一於三。\n施「畫樹法」於「紙」於三百三十二於二百五十六於五十於十於一於三。\n\n施「畫地法」於「紙」於零於五百十二於二百六十於十於五十。\n\n\n施「裱畫」於「紙」於「「out」」");

/***/ }),
/* 43 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("\n姑妄行此。\n\t嗚呼。「「滅頂」」之禍。\n\n如事不諧。豈「「虛指」」之禍歟。\n\t吾有一言。曰「「本無此物。奈何用之」」。書之。\n\n豈「「文法」」之禍歟。\n\t吾有一言。曰「「不合文法。不通之甚」」。書之。\n\n豈「「異類」」之禍歟。\n\t吾有一言。曰「「物各其類。豈可混同」」。書之。\n\n豈「「滅頂」」之禍歟。\n\t吾有一言。曰「「嗚呼哀哉。伏维尚飨」」。書之。\n\n不知何禍歟。名之曰「奇禍」。\n\t吾有一言。曰「「人坐家中。禍從天降」」。書之。\n\n乃作罷。\n\n\n姑妄行此。\n\t嗚呼。「「無足輕重」」之禍。\n如事不諧乃作罷。\n\n\n姑妄行此。\n\t嗚呼。「「事不關心」」之禍。曰「「事不關心。關心者亂」」\n\n如事不諧。不知何禍歟。名之曰「禍」。夫「禍」之「「名」」。書之。乃作罷。");

/***/ }),
/* 44 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾有一術。名之曰「圖靈機」。欲行是術。必先得一列。曰「諸律」。二言。曰「始態」。曰「終態」。\n乃行是術曰。\n\t吾有一列。名之曰「帶」。充「帶」以「「白」」。\n\t有數一。名之曰「針」。\n\n\t吾有二數。曰一。曰一。名之曰「左疆」。曰「右疆」。\n\t吾有一言。曰「始態」。名之曰「態」。\n\n\t吾有一術。名之曰「圖靈機畫法」。是術曰。\n\t\t吾有一言。名之曰「畫帶」。\n\t\t有數「左疆」。名之曰「筆」。恆為是。若「筆」大於「右疆」者乃止也。\n\t\t\t夫「帶」之「筆」。名之曰「符」。\n\t\t\t若「針」等於「筆」者。\n\t\t\t\t加「符」於「「〔」」。加其以「「〕」」昔之「符」者。今其是矣\n\t\t\t若非。\n\t\t\t\t加「符」於「「、」」。加其以「「、」」昔之「符」者。今其是矣\n\t\t\t云云。\n\t\t\t加「畫帶」以「符」。昔之「畫帶」者。今其是矣。\n\n\t\t加一以「筆」。昔之「筆」者。今其是矣云云。\n\t\t吾有四言。曰「態」。曰「「《」」。曰「畫帶」。曰「「》」」書之。\n\t是謂「圖靈機畫法」之術也。\n\n\t施「圖靈機畫法」。噫。\n\n\t恆為是。\n\t\t凡「諸律」中之「律」\n\t\t\t夫「律」之一。名之曰「甲態」。\n\t\t\t夫「律」之二。名之曰「讀符」。\n\t\t\t夫「律」之三。名之曰「乙態」。\n\t\t\t夫「律」之四。名之曰「畫符」。\n\t\t\t夫「律」之五。名之曰「移」。\n\n\t\t\t若「態」等於「甲態」者。若「帶」之「針」等於「讀符」者。\n\t\t\t\t昔之「帶」之「針」者。今「畫符」是矣。\n\t\t\t\t昔之「態」者。今「乙態」是矣。\n\t\t\t\t若「移」等於「「左」」者。減一於「針」。昔之「針」者。今其是矣。云云。\n\t\t\t\t若「移」等於「「右」」者。加一於「針」。昔之「針」者。今其是矣。云云。\n\t\t\t\t乃止。\n\t\t\t云云云云\n\t\t云云。\n\n\t\t若「針」小於「左疆」者。\n\t\t\t昔之「帶」之「針」者。今「「白」」是矣。\n\t\t\t昔之「左疆」者。今「針」是矣。\n\t\t云云\n\t\t若「針」大於「右疆」者。\n\t\t\t昔之「帶」之「針」者。今「「白」」是矣。\n\t\t\t昔之「右疆」者。今「針」是矣。\n\t\t云云\n\n\t\t施「圖靈機畫法」。噫。\n\t\t若「態」等於「終態」者乃止也。\n\t云云。\n是謂「圖靈機」之術也。\n\n\n吾有一術。名之曰「製律」。欲行是術。必先得一列。曰「諸律」。\n\t五言。曰「甲態」。曰「讀符」。曰「乙態」。曰「畫符」。曰「移」。乃行是術曰。\n\t吾有一列。名之曰「律」。\n\t充「律」以「甲態」。以「讀符」。以「乙態」。以「畫符」。以「移」。\n\t充「諸律」以「律」。\n是謂「製律」之術也。\n\n吾有一言。曰「「營營河狸。止于樊。」」。書之。\n\n吾有一列。名之曰「諸律」。\n吾有一言。曰「「墨」」。名之曰「陽符」。\n吾有一言。曰「「白」」。名之曰「陰符」。\n施「製律」於「諸律」於「「甲」」於「陰符」於「「乙」」於「陽符」於「「右」」\n施「製律」於「諸律」於「「甲」」於「陽符」於「「丙」」於「陽符」於「「左」」\n施「製律」於「諸律」於「「乙」」於「陰符」於「「甲」」於「陽符」於「「左」」\n施「製律」於「諸律」於「「乙」」於「陽符」於「「乙」」於「陽符」於「「右」」\n施「製律」於「諸律」於「「丙」」於「陰符」於「「乙」」於「陽符」於「「左」」\n施「製律」於「諸律」於「「丙」」於「陽符」於「「樊」」於「陽符」於「「中」」\n\n施「圖靈機」於「諸律」於「「甲」」於「「樊」」。\n\n\n");

/***/ }),
/* 45 */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

;
__webpack_require__.r(__webpack_exports__);
/* harmony default export */ __webpack_exports__["default"] = ("吾嘗觀『算經』之書。方悟「取底除」之義。\n\n吾有一術。名之曰「增乘開平方」。欲行是術。必先得一數。曰「實」。乃行是術曰。\n\t注曰。『增乘開平方法，以商數乘下法遞增求之。』。\n\t吾有四數。名之曰「果」曰「商」曰「餘」曰「廉」。有數一。名之曰「法」。\n\t恆為是。施「取底除」於「實」於「法」。若其之『商』小於百者乃止也。\n\t\t乘「法」以百。昔之「法」者。今其是矣云云。\n\t恆為是。若「法」不大於零者乃止也。\n\t\t乘「果」以十。昔之「果」者。今其是矣。\n\t\t加「廉」以「商」。乘其以十。昔之「廉」者。今其是矣。\n\t\t施「取底除」於「實」於「法」。名之曰「甲」。\n\t\t昔之「實」者。今「甲」之『商』是矣。\n\t\t昔之「餘」者。今「甲」之『餘』是矣。\n\t\t昔之「商」者。今零是矣。\n\t\t恆為是。加「廉」以「商」。乘其以「商」。若其不小於「實」者乃止也。\n\t\t\t加「商」以一。昔之「商」者。今其是矣云云。\n\t\t加「廉」以「商」。乘其以「商」。若其大於「實」者。\n\t\t\t減「商」以一。昔之「商」者。今其是矣云云。\n\t\t加「廉」以「商」。昔之「廉」者。今其是矣。\n\t\t加「果」以「商」。昔之「果」者。今其是矣。\n\t\t乘「商」以「廉」。減「實」以其。乘其以「法」。加其以「餘」。昔之「實」者。今其是矣。\n\t\t施「取底除」於「法」於百。昔之「法」者。今其之『商』是矣云云。\n\t\t注曰。『商第一位。上商得數以乘下法為乘方。命上商除實。上商得數以乘下法入乘方。一退為廉，下法再退。』。\n\t\t注曰。『商第二位。商得數以乘下法為隅。命上商除實訖。以上商乘下法入隅，皆名曰廉。一退，下法再退，以求第三位商。』。\n\t\t注曰。『商第三位。用法如第二位求之。』。\n\t乃得 「果」。\n是謂「增乘開平方」之術也。\n\n噫。施「增乘開平方」於七萬一千八百二十四。書之。\n注曰。『楊輝算草』。\n");

/***/ })
/******/ ]);
});
//# sourceMappingURL=examples.js.map